#### GetClipRectangle Method

---

|  |
| --- |
| DrawContext Class   See Also |

Gets the clip rectangle for the Revit view where rendering takes place. The clip rectangle is the area currently being redrawn, which may be smaller than the view rectangle.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static Rectangle GetClipRectangle() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetClipRectangle As Rectangle ``` |

| Visual C++ |
| --- |
| ``` public: static Rectangle^ GetClipRectangle() ``` |

#### Return Value

The clip rectangle.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

# See Also

DrawContext Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### LayoutRule Property

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Identifies the layout rule of rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public RebarLayoutRule LayoutRule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LayoutRule As RebarLayoutRule 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property RebarLayoutRule LayoutRule { 	RebarLayoutRule get (); } ``` |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### SetMapOfSizesForStraights Method

---

|  |
| --- |
| FabricationNetworkChangeService Class   See Also |

Set the mapping for sizes of fabrication part straights to change the sizes to.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public void SetMapOfSizesForStraights( 	ISet<FabricationPartSizeMap> fabricationPartSizeMaps ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetMapOfSizesForStraights ( _ 	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetMapOfSizesForStraights( 	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps ) ``` |

#### Parameters

fabricationPartSizeMaps
:   Type:  System.Collections.Generic ISet   FabricationPartSizeMap
     The map containing the original straights size to the mapped sizes.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace

#### CannotCopyWallPanelsWarn Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Cannot copy wall panels unless their parent wall is also being copied.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyWallPanelsWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyWallPanelsWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyWallPanelsWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### WallBaseOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallBaseOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallBaseOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallBaseOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextureRealWorldScaleY Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Size Y" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldScaleY { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldScaleY As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldScaleY { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance" with a minimum of "0.01".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### NetworkCanNotDeterminCriticalPath Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NetworkCanNotDeterminCriticalPath As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NetworkCanNotDeterminCriticalPath { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### WireConduitType Class

---

|  |
| --- |
| Members   See Also |

Represents a specific conduit type of wire type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class WireConduitType : APIObject ``` |

| Visual Basic |
| --- |
| ``` Public Class WireConduitType _ 	Inherits APIObject ``` |

| Visual C++ |
| --- |
| ``` public ref class WireConduitType : public APIObject ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Electrical WireConduitType

# See Also

WireConduitType Members

Autodesk.Revit.DB.Electrical Namespace

#### LampLumenDepreciation Property

---

|  |
| --- |
| AdvancedLossFactor Class   See Also |

The lamp lumen depreciation loss factor.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double LampLumenDepreciation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LampLumenDepreciation As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LampLumenDepreciation { 	double get (); 	void set (double value); } ``` |

#### Field Value

The loss factor as a numerical value between 0.0 and 1.0

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0. |

# See Also

AdvancedLossFactor Class

Autodesk.Revit.DB.Lighting Namespace

#### ColorSelectionDialog Class

---

|  |
| --- |
| Members   See Also |

Allows display of the Revit Color dialog.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public class ColorSelectionDialog : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ColorSelectionDialog _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ColorSelectionDialog : IDisposable ``` |

# Remarks

The class provides the option to launch the Revit Color dialog to select the color.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.UI ColorSelectionDialog

# See Also

ColorSelectionDialog Members

Autodesk.Revit.UI Namespace

#### CannotEditDeletedElements Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

Can't edit the element. It was deleted in the Central Model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotEditDeletedElements { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotEditDeletedElements As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotEditDeletedElements { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### FlangeThicknessLocation Property

---

|  |
| --- |
| StructuralSectionHotRolled Class   See Also |

Flange Thickness Location.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public double FlangeThicknessLocation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlangeThicknessLocation As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double FlangeThicknessLocation { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionHotRolled Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### PaneId Property

---

|  |
| --- |
| DockableFrameFocusChangedEventArgs Class   See Also |

The identifier for dockable pane.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public DockablePaneId PaneId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PaneId As DockablePaneId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DockablePaneId^ PaneId { 	DockablePaneId^ get (); } ``` |

# See Also

DockableFrameFocusChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### SlabEdgeMaterialParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Material"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SlabEdgeMaterialParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SlabEdgeMaterialParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SlabEdgeMaterialParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PlanCircuitSet Constructor

---

|  |
| --- |
| PlanCircuitSet Class   See Also |

Initializes a new instance of the  PlanCircuitSet  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PlanCircuitSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: PlanCircuitSet() ``` |

# See Also

PlanCircuitSet Class

Autodesk.Revit.DB Namespace

#### GetSuperscriptStatus Method

---

|  |
| --- |
| FormattedText Class   See Also |

Returns whether  All  ,  None  or a  Mixed  of characters in the entire text are superscripted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public FormatStatus GetSuperscriptStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSuperscriptStatus As FormatStatus ``` |

| Visual C++ |
| --- |
| ``` public: FormatStatus GetSuperscriptStatus() ``` |

#### Return Value

The format status of superscript on characters  FormatStatus  .

# Remarks

This function only returns  All  or  None  if the entire text contains one character.

# See Also

FormattedText Class

GetSuperscriptStatus Overload

Autodesk.Revit.DB Namespace

#### BreakCurve Method

---

|  |
| --- |
| PlumbingUtils Class   See Also |

Breaks the pipe curve into two parts at the given position.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static ElementId BreakCurve( 	Document document, 	ElementId pipeId, 	XYZ ptBreak ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function BreakCurve ( _ 	document As Document, _ 	pipeId As ElementId, _ 	ptBreak As XYZ _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ BreakCurve( 	Document^ document,  	ElementId^ pipeId,  	XYZ^ ptBreak ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

pipeId
:   Type:  Autodesk.Revit.DB ElementId
     The element id of the pipe curve to break.

ptBreak
:   Type:  Autodesk.Revit.DB XYZ
     The break point on the pipe curve.

#### Return Value

The new pipe curve element id if successful otherwise if a failure occurred an invalidElementId is returned.

# Remarks

This method is not applicable for breaking the flex pipe.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | "The element is neither a pipe nor a pipe placeholder." -or- "The given point is not on the pipe curve." |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PlumbingUtils Class

Autodesk.Revit.DB.Plumbing Namespace

#### LoopSeparationNotCompleted Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

The loop separation is not completed yet. Only one side of the secondary/tertiary loop is separated. In order to correctly calculate the flow and pressure loss, please check and separate the other end of the loop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId LoopSeparationNotCompleted { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoopSeparationNotCompleted As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ LoopSeparationNotCompleted { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### Rad Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol rad, indicating unit Radians.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Rad { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Rad As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Rad { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### AnalysisResultSchema Constructor (AnalysisResultSchema)

---

|  |
| --- |
| AnalysisResultSchema Class   See Also |

Constructs a new copy of the input AnalysisResultSchema object.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public AnalysisResultSchema( 	AnalysisResultSchema other ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	other As AnalysisResultSchema _ ) ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisResultSchema( 	AnalysisResultSchema^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB.Analysis AnalysisResultSchema

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalysisResultSchema Class

AnalysisResultSchema Overload

Autodesk.Revit.DB.Analysis Namespace

#### Efficacy Property

---

|  |
| --- |
| InitialWattageIntensity Class   See Also |

The efficacy value.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Efficacy { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Efficacy As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Efficacy { 	double get (); 	void set (double value); } ``` |

#### Field Value

The efficacy value in lm/W as a numerical value greater than 0.0 and less than 1.0e+10.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The efficacy value is not valid because it is not between 0 and 1e+30. |

# See Also

InitialWattageIntensity Class

Autodesk.Revit.DB.Lighting Namespace

#### BoundingBoxXYZ Class

---

|  |
| --- |
| Members   Example   See Also |

A three-dimensional rectangular box at an arbitrary location and orientation within the Revit model.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public class BoundingBoxXYZ : APIObject ``` |

| Visual Basic |
| --- |
| ``` Public Class BoundingBoxXYZ _ 	Inherits APIObject ``` |

| Visual C++ |
| --- |
| ``` public ref class BoundingBoxXYZ : public APIObject ``` |

# Remarks

BoundingBoxXYZ objects are used in Revit in several places related to views (for example, the section box of a 3D view or the definition of a section or detail view). BoundingBoxXYZ objects can also be obtained from elements representing the boundary of the element in a given view.

The extents of the box are determined by three orthogonal planes extended through the minimum (  Min  ) and maximum (  Max  ) points, but the coordinates of these points and the orientation of the planes in relation to the coordinates of the source model is determined by the box Transform (  Transform  ).

This class also has the ability to detect and mark certain extents as disabled. Note that in the current Revit API uses of this class it is not expected that Revit will give objects with disabled extents, and disabled extents in objects sent to Revit will likely be ignored.

Note: the bounding box may not be empty even if Element::Geometry::get returns nothing. This can happen if the element contains no 3D model geometry since by default, Element::Geometry::get only returns 3D model geometry while GeometryElement::GetBoundingBox also takes 2D plan-view geometry and elevation-view geometry into account.

# Examples

 Copy  C#

```
public void GetBoundingBoxXYZInfo(View3D view3D)
{
    string message = "BoundingBoxXYZ : ";
    message += "\nView name : " + view3D.Name;
    BoundingBoxXYZ boundingBox = view3D.GetSectionBox();
    // The section box of the 3D view can cut the model.
    if (view3D.IsSectionBoxActive)
    {
        BoundingBoxXYZ sectionBox = view3D.GetSectionBox();

        // Note that the section box can be rotated and transformed.
        // So the min/max corners coordinates relative to the model must be computed via the transform.
        Transform trf = sectionBox.Transform;

        XYZ max = sectionBox.Max; //Maximum coordinates (upper-right-front corner of the box before transform is applied).
        XYZ min = sectionBox.Min; //Minimum coordinates (lower-left-rear corner of the box before transform is applied).

        // Transform the min and max to model coordinates
        XYZ maxInModelCoords = trf.OfPoint(max);
        XYZ minInModelCoords = trf.OfPoint(min);

        message += "\nView has an active section box: ";
        message += "\n'Maximum' coordinates: " + maxInModelCoords;
        message += "\n'Minimum' coordinates: " + minInModelCoords;
    }
    TaskDialog.Show("Revit", message);
}
```

 Copy  VB.NET

```
Public Sub GetBoundingBoxXYZInfo(view3D As View3D)
    Dim message As String = "BoundingBoxXYZ : "
    message += vbLf & "View name : " + view3D.Name
    Dim boundingBox As BoundingBoxXYZ = view3D.GetSectionBox()
    ' The section box of the 3D view can cut the model.
    If view3D.IsSectionBoxActive Then
        Dim sectionBox As BoundingBoxXYZ = view3D.GetSectionBox()

        ' Note that the section box can be rotated and transformed.
        ' So the min/max corners coordinates relative to the model must be computed via the transform.
        Dim trf As Transform = sectionBox.Transform

        Dim max As XYZ = sectionBox.Max
        'Maximum coordinates (upper-right-front corner of the box before transform is applied).
        Dim min As XYZ = sectionBox.Min
        'Minimum coordinates (lower-left-rear corner of the box before transform is applied).
        ' Transform the min and max to model coordinates
        Dim maxInModelCoords As XYZ = trf.OfPoint(max)
        Dim minInModelCoords As XYZ = trf.OfPoint(min)

        message += vbLf & "View has an active section box: "
        message += vbLf & "Maximum' coordinates: " + maxInModelCoords.ToString()
        message += vbLf & "Minimum' coordinates: " + minInModelCoords.ToString()
    End If
    TaskDialog.Show("Revit", message)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB BoundingBoxXYZ

# See Also

BoundingBoxXYZ Members

Autodesk.Revit.DB Namespace

#### MassDataMassOpeningArea Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Mass Opening Area"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MassDataMassOpeningArea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MassDataMassOpeningArea As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MassDataMassOpeningArea { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ShowSettings Method

---

|  |
| --- |
| IPipeFittingAndAccessoryPressureDropUIServer Interface   See Also |

Shows the settings UI.

**Namespace:**   Autodesk.Revit.UI.Plumbing
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` bool ShowSettings( 	PipeFittingAndAccessoryPressureDropUIData data ) ``` |

| Visual Basic |
| --- |
| ``` Function ShowSettings ( _ 	data As PipeFittingAndAccessoryPressureDropUIData _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` bool ShowSettings( 	PipeFittingAndAccessoryPressureDropUIData^ data ) ``` |

#### Parameters

data
:   Type:  Autodesk.Revit.UI.Plumbing PipeFittingAndAccessoryPressureDropUIData
     The input data of the calculation.

#### Return Value

True if the user makes any changes in the UI, false otherwise.

# See Also

IPipeFittingAndAccessoryPressureDropUIServer Interface

Autodesk.Revit.UI.Plumbing Namespace

#### LoadNatureName Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadNatureName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadNatureName As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadNatureName { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DownloadFinished Property

---

|  |
| --- |
| CreateRelatedFileProgressChangedEventArgs Class   See Also |

Indicates if all data downloads are finished.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool DownloadFinished { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DownloadFinished As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool DownloadFinished { 	bool get (); } ``` |

# See Also

CreateRelatedFileProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### NamingUtils Class

---

|  |
| --- |
| Members   See Also |

A collection of utilities related to element naming.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static class NamingUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class NamingUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class NamingUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB NamingUtils

# See Also

NamingUtils Members

Autodesk.Revit.DB Namespace

#### GetLabelFor Method (BuiltInCategory)

---

|  |
| --- |
| LabelUtils Class   See Also |

Gets the user-visible name for a BuiltInCategory.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public static string GetLabelFor( 	BuiltInCategory builtInCategory ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetLabelFor ( _ 	builtInCategory As BuiltInCategory _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ GetLabelFor( 	BuiltInCategory builtInCategory ) ``` |

#### Parameters

builtInCategory
:   Type:  Autodesk.Revit.DB BuiltInCategory
     The BuiltInCategory to get the user-visible name.

# Remarks

The name is obtained in the current Revit language.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the builtin category is not valid. |

# See Also

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace

#### ExcessLengthFillSpacing Property

---

|  |
| --- |
| BalusterPattern Class   See Also |

The value defines the spacing between each baluster instance inserted in the excess length.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public double ExcessLengthFillSpacing { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ExcessLengthFillSpacing As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ExcessLengthFillSpacing { 	double get (); 	void set (double value); } ``` |

# Remarks

The spacing is used only if a baluster family is set to excess length fill.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for excessLengthFillSpacing must be between 0 and 30000 feet. |

# See Also

BalusterPattern Class

Autodesk.Revit.DB.Architecture Namespace

#### ImportPlacement Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible placement modes for imported drawings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ImportPlacement ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ImportPlacement ``` |

| Visual C++ |
| --- |
| ``` public enum class ImportPlacement ``` |

# Members

| Member name | Description |
| --- | --- |
| Site | Placement at Base Point. Useful for Revit links only. There must be a reference point in order for this option to be valid. |
| Origin | Placement at the Origin. If reference point is provided, then the import is placed so the point is at the model's origin. If no point is provided, then the document's origin is matched with the model's origin. |
| Centered | Placement at the Center. If reference point is provided, then the import is placed so the point is at the model's center. If no point is provided, then the document's center is matched with the model's origin. |
| Shared | Placement with respect to the shared coordinates. Revit Building places the imported geometry according to its location with respect to the shared coordinates between the two files. There must be shared coordinates in a Revit document in order for this option to be valid. |

# See Also

Autodesk.Revit.DB Namespace

#### ViewActivatedEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the ViewActivated event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public class ViewActivatedEventArgs : RevitAPIPostDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class ViewActivatedEventArgs _ 	Inherits RevitAPIPostDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class ViewActivatedEventArgs : public RevitAPIPostDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostDocEventArgs
  Autodesk.Revit.UI.Events ViewActivatedEventArgs

# See Also

ViewActivatedEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### GetProjectionToSheetTransform Method

---

|  |
| --- |
| Viewport Class   See Also |

Returns the transform from the view's projection space to the sheet space.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public Transform GetProjectionToSheetTransform() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetProjectionToSheetTransform As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ GetProjectionToSheetTransform() ``` |

#### Return Value

The transform from the view's projection space to the sheet space.

# Remarks

This transform accounts for the position and rotation of a viewport on a sheet.

The transforms from the model space to the view projection space are returned by  [!:View.GetModelToProjectionTransforms()]  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The viewport is not on a sheet. -or- The viewport does not have transforms. |

# See Also

Viewport Class

Autodesk.Revit.DB Namespace

#### Tonsf Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Tonsf, indicating unit US tonnes force.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Tonsf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Tonsf As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Tonsf { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RoomNumberOfPeopleParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Number of People"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoomNumberOfPeopleParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoomNumberOfPeopleParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoomNumberOfPeopleParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextureRealWorldOffsetX Property

---

|  |
| --- |
| Gradient Class   See Also |

The property labeled "Offset X" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetX As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetX { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Gradient Class

Autodesk.Revit.DB.Visual Namespace

#### CouplerMark Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Schedule Mark"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CouplerMark { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CouplerMark As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CouplerMark { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| MEPSystem Class   See Also |

Indicates if the system is empty or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsEmpty { 	bool get (); } ``` |

# Remarks

returns true if the system doesn't contain any components

# See Also

MEPSystem Class

Autodesk.Revit.DB Namespace

#### RbsPipingSystemTypeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"System Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipingSystemTypeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipingSystemTypeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipingSystemTypeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetGeometricalObjects Method

---

|  |
| --- |
| TessellatedShapeBuilderResult Class   See Also |

When called the first time, returns geometrical objects which were built. Later calls will throw exceptions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public IList<GeometryObject> GetGeometricalObjects() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetGeometricalObjects As IList(Of GeometryObject) ``` |

| Visual C++ |
| --- |
| ``` public: IList<GeometryObject^>^ GetGeometricalObjects() ``` |

#### Return Value

Geometrical object which were built.

# Remarks

Normally an array contains a single geometrical object corresponding to either 'target' or 'fallback' type', but if multiple face sets are being built with target/fallback of "AnyGeometry/Mesh", then a two-element array with both geometry as the 1st element and mesh as the 2nd can be returned. It happens if some of the face sets require a fallback processing and some do not.

# See Also

TessellatedShapeBuilderResult Class

Autodesk.Revit.DB Namespace

#### ViewSolarstudyStillDateValue Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Still date"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudyStillDateValue { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudyStillDateValue As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudyStillDateValue { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| Document Class   See Also |

Releases all resources used by the  Document

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### SourceDocument Property

---

|  |
| --- |
| TransferringProjectStandardsEventArgs Class   See Also |

Source document.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017.2

# Syntax

| C# |
| --- |
| ``` public Document SourceDocument { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property SourceDocument As Document 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Document^ SourceDocument { 	Document^ get (); } ``` |

# See Also

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### IsShownOnlyWhenCut Property

---

|  |
| --- |
| FamilyElementVisibility Class   See Also |

Indicates if the instance is displayed only if it has been cut.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsShownOnlyWhenCut { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsShownOnlyWhenCut As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsShownOnlyWhenCut { 	bool get (); 	void set (bool value); } ``` |

# Remarks

This property matters for objects which visibility type is ViewSpecific.

# See Also

FamilyElementVisibility Class

Autodesk.Revit.DB Namespace

#### RebarSystemTopMinorMatchesBottomMinor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top and Bottom Minor Layers Match"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemTopMinorMatchesBottomMinor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemTopMinorMatchesBottomMinor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemTopMinorMatchesBottomMinor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ArrowheadTypeId Property

---

|  |
| --- |
| StairsPathType Class   See Also |

The arrow head type of the stairs path.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId ArrowheadTypeId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ArrowheadTypeId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ArrowheadTypeId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The arrowheadTypeId is not a valid arrow head type. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

StairsPathType Class

Autodesk.Revit.DB.Architecture Namespace

#### NothingToApplyWarning Property

---

|  |
| --- |
| BuiltInFailures ViewFailures Class   See Also |

Start and end elevations are the same, nothing to Apply.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NothingToApplyWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NothingToApplyWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NothingToApplyWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ViewFailures Class

Autodesk.Revit.DB Namespace

#### DistanceFromPreviousOrSpace Property

---

|  |
| --- |
| BalusterInfo Class   See Also |

The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public double DistanceFromPreviousOrSpace { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DistanceFromPreviousOrSpace As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double DistanceFromPreviousOrSpace { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for distanceFromPreviousOrSpace is not finite |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for distanceFromPreviousOrSpace must be greater than 0 and no more than 30000 feet. |

# See Also

BalusterInfo Class

Autodesk.Revit.DB.Architecture Namespace

#### InvalidCropAreaSketchRegen Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Crop area sketch can either be empty or include one closed, not self-intersecting loop.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidCropAreaSketchRegen { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidCropAreaSketchRegen As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidCropAreaSketchRegen { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### NumberOfUGridlines Property

---

|  |
| --- |
| DividedSurface Class   See Also |

Get the number of U-gridlines used on the surface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumberOfUGridlines { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfUGridlines As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfUGridlines { 	int get (); } ``` |

# See Also

DividedSurface Class

Autodesk.Revit.DB Namespace

#### GetProductListEntryName Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Gets the specified product list entry name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016 Subscription Release

# Syntax

| C# |
| --- |
| ``` public string GetProductListEntryName( 	int index ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetProductListEntryName ( _ 	index As Integer _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetProductListEntryName( 	int index ) ``` |

#### Parameters

index
:   Type:  System Int32
     The product entry index.

#### Return Value

Returns the specified product entry name.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The product entry index is not larger than 0 and less than GetProductCount. |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### PaperSourceSet Constructor

---

|  |
| --- |
| PaperSourceSet Class   See Also |

Initializes a new instance of the  PaperSourceSet  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PaperSourceSet() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: PaperSourceSet() ``` |

# See Also

PaperSourceSet Class

Autodesk.Revit.DB Namespace

#### RebarHookType Class

---

|  |
| --- |
| Members   See Also |

A Rebar Hook type object that is used in the generation of Rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class RebarHookType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class RebarHookType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class RebarHookType : public ElementType ``` |

# Remarks

This object contains the definition of the hooks that may be created at the ends of the rebar. The specifics of these hooks are angle (range 0-PI) between first/last segment of rebar and the straight segment of the hook, rebar shape style and a multiplier used to compute the length of the straight segment of the hook. The default length is computed as the bar diameter \* the multiplier. Length can be overridden by settings in the RebarBarType class.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Structure RebarHookType

# See Also

RebarHookType Members

Autodesk.Revit.DB.Structure Namespace

#### CableTraySize Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Cable Tray Size, in discipline Electrical.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CableTraySize { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CableTraySize As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CableTraySize { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### Space Property

---

|  |
| --- |
| FamilyInstance Class   See Also |

The space in which the instance is located (during the last phase of the project).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Space Space { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Space As Space 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Space^ Space { 	Space^ get (); } ``` |

# Remarks

This property will be the first space encountered that contains the instance. If more than one space includes this point in its volume only the first one is returned. If no space is found that contains the instance, this property is    a null reference (  Nothing  in Visual Basic)  .

# See Also

FamilyInstance Class

Space Overload

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| AnalysisDisplayDiagramSettings Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### GetGlobal2DOriginHandle Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Obtains the handle representing the 2D origin.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static IFCAnyHandle GetGlobal2DOriginHandle() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetGlobal2DOriginHandle As IFCAnyHandle ``` |

| Visual C++ |
| --- |
| ``` public: static IFCAnyHandle^ GetGlobal2DOriginHandle() ``` |

#### Return Value

The handle.

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### DividedpathDistance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DividedpathDistance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedpathDistance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DividedpathDistance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| RevitLinkOptions Class   See Also |

Releases all resources used by the  RevitLinkOptions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RevitLinkOptions Class

Autodesk.Revit.DB Namespace

#### RegisterDockablePane Method

---

|  |
| --- |
| UIControlledApplication Class   Example   See Also |

Adds a new dockable pane to the Revit user interface.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void RegisterDockablePane( 	DockablePaneId id, 	string title, 	IDockablePaneProvider provider ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RegisterDockablePane ( _ 	id As DockablePaneId, _ 	title As String, _ 	provider As IDockablePaneProvider _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RegisterDockablePane( 	DockablePaneId^ id,  	String^ title,  	IDockablePaneProvider^ provider ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.UI DockablePaneId
     Unique identifier for the new pane.

title
:   Type:  System String
     String to use for the pane caption.

provider
:   Type:  Autodesk.Revit.UI IDockablePaneProvider
     Your add-in's implementation of the IDockablePaneProvider interface.

# Examples

 Copy  C#

```
public Result OnStartup(UIControlledApplication application)
{
   // Create our pane provider and register it with the application
   PaneProvider prov = new PaneProvider();
   DockablePaneId id = new DockablePaneId(Guid.NewGuid());
   application.RegisterDockablePane(id, "test", prov);

   return Result.Succeeded;
}
```

 Copy  VB.NET

```
Public Function OnStartup(application As UIControlledApplication) As Result Implements IExternalApplication.OnStartup
    ' Create our pane provider and register it with the application
    Dim prov As New PaneProvider()
    Dim id As New DockablePaneId(Guid.NewGuid())
    application.RegisterDockablePane(id, "test", prov)

    Return Result.Succeeded
End Function
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if a dockable pane with identifier %id% has already been registered. |

# See Also

UIControlledApplication Class

Autodesk.Revit.UI Namespace

#### FindTypeByName Method

---

|  |
| --- |
| MEPAnalyticalConnectionType Class   See Also |

Finds the analytical connection type by its name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static ElementId FindTypeByName( 	Document doc, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function FindTypeByName ( _ 	doc As Document, _ 	name As String _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ FindTypeByName( 	Document^ doc,  	String^ name ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document where the analytical conneciton type is expected.

name
:   Type:  System String
     The name of the expected analytical connection type.

#### Return Value

The element id of matched analytical connection type, otherwise invalidElementId.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace

#### DividedSurfaceAllPoints Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show all points"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DividedSurfaceAllPoints { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DividedSurfaceAllPoints As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DividedSurfaceAllPoints { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AlignPartByInsertionPoint Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Align the part by its insertion point to a point and rotation in free space.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool AlignPartByInsertionPoint( 	Document document, 	ElementId partId, 	XYZ position, 	double rotation, 	double rotationPerpendicular, 	double slope, 	FabricationPartJustification justification, 	Transform trf ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AlignPartByInsertionPoint ( _ 	document As Document, _ 	partId As ElementId, _ 	position As XYZ, _ 	rotation As Double, _ 	rotationPerpendicular As Double, _ 	slope As Double, _ 	justification As FabricationPartJustification, _ 	trf As Transform _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool AlignPartByInsertionPoint( 	Document^ document,  	ElementId^ partId,  	XYZ^ position,  	double rotation,  	double rotationPerpendicular,  	double slope,  	FabricationPartJustification justification,  	Transform^ trf ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

partId
:   Type:  Autodesk.Revit.DB ElementId
     The element identifier of the part to align.

position
:   Type:  Autodesk.Revit.DB XYZ
     The position to move the part's insertion point to.

rotation
:   Type:  System Double
     The rotation in radians.

rotationPerpendicular
:   Type:  System Double
     The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.

slope
:   Type:  System Double
     The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied to fittings, whilst straights will inherit the slope from the piece it is connecting to.

justification
:   Type:  Autodesk.Revit.DB.Fabrication FabricationPartJustification
     The justification to align eccentric parts.

trf
:   Type:  Autodesk.Revit.DB Transform
     Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.

#### Return Value

True if the alignment succeeds, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element is not a fabrication part. -or- Not all of the fabrication part's connectors are open. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### DefaultParamaterValuesIncorrect Property

---

|  |
| --- |
| BuiltInFailures RebarShapeFailures Class   See Also |

Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DefaultParamaterValuesIncorrect { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DefaultParamaterValuesIncorrect As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DefaultParamaterValuesIncorrect { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarShapeFailures Class

Autodesk.Revit.DB Namespace

#### PanelTypeSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains panel types.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PanelTypeSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class PanelTypeSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class PanelTypeSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB PanelTypeSet

# See Also

PanelTypeSet Members

Autodesk.Revit.DB Namespace

#### CutForegroundPatternColor Property

---

|  |
| --- |
| Material Class   See Also |

The color of the material cut foreground pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public Color CutForegroundPatternColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CutForegroundPatternColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ CutForegroundPatternColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

Material Class

Autodesk.Revit.DB Namespace

#### WinderFilletRadiusTooLargeFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The value for Fillet Radius is too large to satisfy the Minimum Inside Width value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WinderFilletRadiusTooLargeFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WinderFilletRadiusTooLargeFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WinderFilletRadiusTooLargeFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### RebarBarDiameter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bar Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarBarDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarBarDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarBarDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Weights Property

---

|  |
| --- |
| NurbSpline Class   See Also |

Returns the weights of the nurb spline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public DoubleArray Weights { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Weights As DoubleArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DoubleArray^ Weights { 	DoubleArray^ get (); } ``` |

# See Also

NurbSpline Class

Autodesk.Revit.DB Namespace

#### Start Method (ElementId, ElementId)

---

|  |
| --- |
| StairsEditScope Class   See Also |

Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId Start( 	ElementId baseLevelId, 	ElementId topLevelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Start ( _ 	baseLevelId As ElementId, _ 	topLevelId As ElementId _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ Start( 	ElementId^ baseLevelId,  	ElementId^ topLevelId ) ``` |

#### Parameters

baseLevelId
:   Type:  Autodesk.Revit.DB ElementId
     The base level on which the stairs is to be placed.

topLevelId
:   Type:  Autodesk.Revit.DB ElementId
     The top level where the stairs is to reach.

#### Return Value

ElementId of the new stairs.

# Remarks

A new stairs will be created after this operation. User will need to start a transaction to actually make changes to the stairs element. StairsEditScope can only be started when there is no transaction active Thus it does not work for commands running in automatic transaction mode.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | It is not a Level's id. -or- Top level should be higher than base level. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This StairsEditScope is not permitted to start at this moment for one of the following possible reasons: The document is in read-only state, or the document is currently modifiable, or there already is another edit mode active in the document. |

# See Also

StairsEditScope Class

Start Overload

Autodesk.Revit.DB Namespace

#### BuiltInFailures.AlignmentFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures related to alignment elements and annotations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static class AlignmentFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class AlignmentFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class AlignmentFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures AlignmentFailures

# See Also

BuiltInFailures AlignmentFailures Members

Autodesk.Revit.DB Namespace

#### LeaderEndPosition Property

---

|  |
| --- |
| DimensionSegment Class   See Also |

The position of the dimension leader end point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015 Subscription Update.

# Syntax

| C# |
| --- |
| ``` public XYZ LeaderEndPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LeaderEndPosition As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ LeaderEndPosition { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Remarks

This property is not applicable to all dimensions. For example, it is not available for spot dimensions, dimensions using equality formula, and when dimension style is ordinate.

If the position is not applicable, this property returns NULL and will not allow setting a value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ApplicationException | Thrown when the dimension text is unavailable. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when:  * The dimension text is a SpotElevation * When using equality formula. * When dimension style is ordinate. |

# See Also

DimensionSegment Class

Autodesk.Revit.DB Namespace

#### CollectGeometryInfo Method (ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean)

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Collects all the target geometry from the input geometry object and adds it as IFC handles to the IFCInfo.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void CollectGeometryInfo( 	ExporterIFC exporterIFC, 	IFCGeometryInfo geometryInfo, 	GeometryObject gNode, 	XYZ offset, 	bool forceVisible ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub CollectGeometryInfo ( _ 	exporterIFC As ExporterIFC, _ 	geometryInfo As IFCGeometryInfo, _ 	gNode As GeometryObject, _ 	offset As XYZ, _ 	forceVisible As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void CollectGeometryInfo( 	ExporterIFC^ exporterIFC,  	IFCGeometryInfo^ geometryInfo,  	GeometryObject^ gNode,  	XYZ^ offset,  	bool forceVisible ) ``` |

#### Parameters

exporterIFC
:   Type:  Autodesk.Revit.DB.IFC ExporterIFC
     The exporter.

geometryInfo
:   Type:  Autodesk.Revit.DB.IFC IFCGeometryInfo
     The container object which collects the geometry.

gNode
:   Type:  Autodesk.Revit.DB GeometryObject
     The geometry object to be processed.

offset
:   Type:  Autodesk.Revit.DB XYZ
     The offset to apply to each of the collected geometry handles.

forceVisible
:   Type:  System Boolean
     True to process geometry which is not set as visible. False to only process visible geometry.

# Remarks

The type of geometry collected is determined by the method of creation for the IFCGeometryInfo.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

CollectGeometryInfo Overload

Autodesk.Revit.DB.IFC Namespace

#### NotAllPartsWereConvertedCannotAddPlaceholderWarning Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

Not all parts were converted. Placeholders could not be added to fill the gap (the gap was too small). Check the fabrication service definition for the system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotAllPartsWereConvertedCannotAddPlaceholderWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotAllPartsWereConvertedCannotAddPlaceholderWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotAllPartsWereConvertedCannotAddPlaceholderWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### PaperOrientation Property

---

|  |
| --- |
| PDFExportOptions Class   See Also |

Paper orientation - Portrait/Landscape/Auto

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public PageOrientationType PaperOrientation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PaperOrientation As PageOrientationType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property PageOrientationType PaperOrientation { 	PageOrientationType get (); 	void set (PageOrientationType value); } ``` |

# Remarks

Ignored when the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PDFExportOptions Class

Autodesk.Revit.DB Namespace

#### Rounding Property

---

|  |
| --- |
| AnalysisDisplayVectorSettings Class   See Also |

Increment to which numeric values of analysis results are rounded in vectors.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public double Rounding { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Rounding As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Rounding { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | When setting this property: rounding is not positive |

# See Also

AnalysisDisplayVectorSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### PerformanceAdviserRuleId Class

---

|  |
| --- |
| Members   See Also |

The unique identifier of a PerformanceAdviserRule

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class PerformanceAdviserRuleId : GuidEnum ``` |

| Visual Basic |
| --- |
| ``` Public Class PerformanceAdviserRuleId _ 	Inherits GuidEnum ``` |

| Visual C++ |
| --- |
| ``` public ref class PerformanceAdviserRuleId : public GuidEnum ``` |

# Remarks

Each performance adviser rule registered in application must be given a unique id that can be used to identify and unregister rule later.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB GuidEnum
  Autodesk.Revit.DB PerformanceAdviserRuleId

# See Also

PerformanceAdviserRuleId Members

Autodesk.Revit.DB Namespace

#### CurtaingridAnglen1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Angle"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtaingridAnglen1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtaingridAnglen1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtaingridAnglen1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetReleaseType Method

---

|  |
| --- |
| AnalyticalMember Class   See Also |

Gets the release type.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ReleaseType GetReleaseType( 	bool start ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetReleaseType ( _ 	start As Boolean _ ) As ReleaseType ``` |

| Visual C++ |
| --- |
| ``` public: ReleaseType GetReleaseType( 	bool start ) ``` |

#### Parameters

start
:   Type:  System Boolean
     The position on Analytical Member element. True for start, false for end.

#### Return Value

The type of release.

# See Also

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace

#### InsertComponentViewError Property

---

|  |
| --- |
| BuiltInFailures ViewFailures Class   See Also |

This type of Component cannot be placed in Elevation or Section view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InsertComponentViewError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InsertComponentViewError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InsertComponentViewError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ViewFailures Class

Autodesk.Revit.DB Namespace

#### GetBasicIEnumerator Method

---

|  |
| --- |
| ExportLinetypeTable Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` internal virtual IEnumerator GetBasicIEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Friend Overridable Function GetBasicIEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` internal: virtual IEnumerator^ GetBasicIEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable GetEnumerator

# See Also

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Releases all resources used by the  ExportLayerInfo

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace

#### CannotCopyMustBeUniqueViewportWarn Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Multiple instances of the same view in sheets not supported. CannotCopyMustBeUniqueViewportWarn is deprecated in Revit 2023 and may be removed in future verison of Revit. Please use ViewInAModelMustBeUniqueWarn instead.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyMustBeUniqueViewportWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyMustBeUniqueViewportWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyMustBeUniqueViewportWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### SheetScheduled Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Appears In Sheet List"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SheetScheduled { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetScheduled As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SheetScheduled { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RoofLevelOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Offset From Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoofLevelOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoofLevelOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoofLevelOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelTotalloadPowerParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Total Connected"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelTotalloadPowerParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelTotalloadPowerParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelTotalloadPowerParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, Element, XYZ, ElementId, ElementId, ElementId)

---

|  |
| --- |
| AreaReinforcement Class   See Also |

Creates a new AreaReinforcement object based on a host boundary.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static AreaReinforcement Create( 	Document document, 	Element hostElement, 	XYZ majorDirection, 	ElementId areaReinforcementTypeId, 	ElementId rebarBarTypeId, 	ElementId rebarHookTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	hostElement As Element, _ 	majorDirection As XYZ, _ 	areaReinforcementTypeId As ElementId, _ 	rebarBarTypeId As ElementId, _ 	rebarHookTypeId As ElementId _ ) As AreaReinforcement ``` |

| Visual C++ |
| --- |
| ``` public: static AreaReinforcement^ Create( 	Document^ document,  	Element^ hostElement,  	XYZ^ majorDirection,  	ElementId^ areaReinforcementTypeId,  	ElementId^ rebarBarTypeId,  	ElementId^ rebarHookTypeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

hostElement
:   Type:  Autodesk.Revit.DB Element
     The element that will host the AreaReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.

majorDirection
:   Type:  Autodesk.Revit.DB XYZ
     A vector to define the major direction of the AreaReinforcement.

areaReinforcementTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the AreaReinforcementType.

rebarBarTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarBarType.

rebarHookTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the RebarHookType. If this parameter is InvalidElementId, it means to create a rebar with no hooks.

#### Return Value

The newly created AreaReinforcement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element hostElement was not found in the given document. -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- areaReinforcementTypeId should refer to an AreaReinforcementType element. -or- rebarBarTypeId should refer to an RebarBarType element. -or- rebarHookTypeId should be invalid or refer to an RebarHookType element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | majorDirection has zero length. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | This method may not be called during dynamic update. |

# See Also

AreaReinforcement Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### MoveElements Method

---

|  |
| --- |
| ElementTransformUtils Class   See Also |

Moves a set of elements by a given transformation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void MoveElements( 	Document document, 	ICollection<ElementId> elementsToMove, 	XYZ translation ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub MoveElements ( _ 	document As Document, _ 	elementsToMove As ICollection(Of ElementId), _ 	translation As XYZ _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void MoveElements( 	Document^ document,  	ICollection<ElementId^>^ elementsToMove,  	XYZ^ translation ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that owns the elements.

elementsToMove
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of elements to move.

translation
:   Type:  Autodesk.Revit.DB XYZ
     The translation vector for the elements.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given element id set is empty. -or- One or more elements in elementsToMove do not exist in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | If we are not able to move all the elements (for example, if one or more elements is pinned). -or- Move operation failed. |

# See Also

ElementTransformUtils Class

Autodesk.Revit.DB Namespace

#### MinRunWidth Property

---

|  |
| --- |
| StairsType Class   See Also |

The initial value for the width of a common run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double MinRunWidth { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MinRunWidth As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double MinRunWidth { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for minRunWidth must be greater than 0 and no more than 30000 feet. |

# See Also

StairsType Class

Autodesk.Revit.DB.Architecture Namespace

#### CanHaveTypeAssigned Method (Document, ICollection(ElementId))

---

|  |
| --- |
| Element Class   See Also |

Checks if all elements in the set can have a type assigned.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool CanHaveTypeAssigned( 	Document document, 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanHaveTypeAssigned ( _ 	document As Document, _ 	elementIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanHaveTypeAssigned( 	Document^ document,  	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     A collection of element IDs.

#### Return Value

True if all elements in the set can have a type assigned, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when at least one of the elements does not exist in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Element Class

CanHaveTypeAssigned Overload

Autodesk.Revit.DB Namespace

#### SetMeasurementDescriptions Method

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

Sets Descriptions for all measurements

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetMeasurementDescriptions( 	IList<string> measurementDescriptions ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetMeasurementDescriptions ( _ 	measurementDescriptions As IList(Of String) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetMeasurementDescriptions( 	IList<String^>^ measurementDescriptions ) ``` |

#### Parameters

measurementDescriptions
:   Type:  System.Collections.Generic IList   String
     Array of measurement descriptions. The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | measurementDescriptions lengths is not equal to the number of measurements set during creation of SpatialFieldManager |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace

#### Dispose Method

---

|  |
| --- |
| ModelPath Class   See Also |

Releases all resources used by the  ModelPath

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ModelPath Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExportLayerTableIterator Class   See Also |

Releases all resources used by the  ExportLayerTableIterator

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

# See Also

ExportLayerTableIterator Class

Autodesk.Revit.DB Namespace

#### WireMaterialType Class

---

|  |
| --- |
| Members   See Also |

Represents electrical wire material type definition information of wire type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class WireMaterialType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class WireMaterialType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class WireMaterialType : public ElementType ``` |

# Remarks

All the other properties of wire type are based on wire material type. Only the wire material types which are retrieved from ElectricalSetting can work well, so don't retrieve it from Revit project directly.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Electrical WireMaterialType

# See Also

WireMaterialType Members

Autodesk.Revit.DB.Electrical Namespace

#### RiserIntWithBoundaryMoreThanOnceFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Riser intersects with boundary more than once.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RiserIntWithBoundaryMoreThanOnceFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RiserIntWithBoundaryMoreThanOnceFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### RbsElecCircuitPathModeParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Path Mode"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecCircuitPathModeParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecCircuitPathModeParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecCircuitPathModeParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsReaction Property

---

|  |
| --- |
| LoadBase Class   See Also |

The load is reaction option.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool IsReaction { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsReaction As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsReaction { 	bool get (); 	void set (bool value); } ``` |

# See Also

LoadBase Class

Autodesk.Revit.DB.Structure Namespace

#### CannotMergeGeometry Property

---

|  |
| --- |
| BuiltInFailures MassFailures Class   See Also |

The Mass contains geometry that cannot be combined. Mass Floors, volume, and surface area, won't be computed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotMergeGeometry { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotMergeGeometry As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotMergeGeometry { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MassFailures Class

Autodesk.Revit.DB Namespace

#### GetPresureDropItems Method

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropData Class   See Also |

Returns the pressure drop items.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<DuctFittingAndAccessoryPressureDropItem> GetPresureDropItems() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPresureDropItems As IList(Of DuctFittingAndAccessoryPressureDropItem) ``` |

| Visual C++ |
| --- |
| ``` public: IList<DuctFittingAndAccessoryPressureDropItem^>^ GetPresureDropItems() ``` |

# See Also

DuctFittingAndAccessoryPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace

#### MinimumLength Property

---

|  |
| --- |
| RouteAnalysisSettings Class   See Also |

The constant storing minimum allowed length of path of travel

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public double MinimumLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MinimumLength As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MinimumLength { 	double get (); } ``` |

# See Also

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### GraphicDisplayOptionsSketchyLines Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Sketchy Lines"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId GraphicDisplayOptionsSketchyLines { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property GraphicDisplayOptionsSketchyLines As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ GraphicDisplayOptionsSketchyLines { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetInsulationIds Method

---

|  |
| --- |
| InsulationLiningBase Class   See Also |

Returns the ids of the insulation elements associated to a given element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> GetInsulationIds( 	Document document, 	ElementId elemId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetInsulationIds ( _ 	document As Document, _ 	elemId As ElementId _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ GetInsulationIds( 	Document^ document,  	ElementId^ elemId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

elemId
:   Type:  Autodesk.Revit.DB ElementId
     The element.

#### Return Value

A collection of the ids of the insulation elements.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This id does not represent a valid host for insulation. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

InsulationLiningBase Class

Autodesk.Revit.DB Namespace

#### SheetNumberEmpty Property

---

|  |
| --- |
| BuiltInFailures SheetFailures Class   See Also |

Sheet Number is empty

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SheetNumberEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetNumberEmpty As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SheetNumberEmpty { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SheetFailures Class

Autodesk.Revit.DB Namespace

#### GetSpecificFittingAngleStatus Method

---

|  |
| --- |
| DuctSettings Class   See Also |

Gets the status of given specific angle.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool GetSpecificFittingAngleStatus( 	double angle ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSpecificFittingAngleStatus ( _ 	angle As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool GetSpecificFittingAngleStatus( 	double angle ) ``` |

#### Parameters

angle
:   Type:  System Double
     The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees. |

# See Also

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### ValidateCurve Method (Curve, DirectShapeTargetViewType)

---

|  |
| --- |
| ViewShapeBuilder Class   See Also |

Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static bool ValidateCurve( 	Curve GCurve, 	DirectShapeTargetViewType targetViewType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ValidateCurve ( _ 	GCurve As Curve, _ 	targetViewType As DirectShapeTargetViewType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ValidateCurve( 	Curve^ GCurve,  	DirectShapeTargetViewType targetViewType ) ``` |

#### Parameters

GCurve
:   Type:  Autodesk.Revit.DB Curve
     Curve object to be validated.

targetViewType
:   Type:  Autodesk.Revit.DB DirectShapeTargetViewType
     View type for which this curve is intended.

#### Return Value

True is %GCurve% is acceptable as a part of view-specific shape representation.

# Remarks

Validation conditions depend on the type of view for which the shape representation is intended. For plan views, a curve is expected to be planar and non-degenerate (e.g., NOT a circle of zero radius).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ViewShapeBuilder Class

ValidateCurve Overload

Autodesk.Revit.DB Namespace

#### CurrentType Property

---

|  |
| --- |
| FamilyManager Class   See Also |

The current family type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyType CurrentType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CurrentType As FamilyType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FamilyType^ CurrentType { 	FamilyType^ get (); 	void set (FamilyType^ value); } ``` |

# Remarks

Only the current family type is editable using the methods in  FamilyManager  . If you want to modify the properties of any family type, it must be set to be the current type first. This value will be    a null reference (  Nothing  in Visual Basic)  if there is no type in the family. In order to modify parameter values, you will need to create one using  NewType(String)  .

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace

#### CoarseScaleFillPatternIdParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Coarse Scale Fill Pattern"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CoarseScaleFillPatternIdParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CoarseScaleFillPatternIdParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CoarseScaleFillPatternIdParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LoadAreaForceFy2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Fy 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LoadAreaForceFy2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LoadAreaForceFy2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LoadAreaForceFy2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FilteredWorksetIdIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class FilteredWorksetIdIterator : IEnumerator<WorksetId> ``` |

| Visual Basic |
| --- |
| ``` Public Class FilteredWorksetIdIterator _ 	Implements IEnumerator(Of WorksetId) ``` |

| Visual C++ |
| --- |
| ``` public ref class FilteredWorksetIdIterator : IEnumerator<WorksetId^> ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FilteredWorksetIdIterator

# See Also

FilteredWorksetIdIterator Members

Autodesk.Revit.DB Namespace

#### SetPointConstraintType Method

---

|  |
| --- |
| AdaptiveComponentFamilyUtils Class   See Also |

Sets constrain type of an Adaptive Shape Handle Point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void SetPointConstraintType( 	Document doc, 	ElementId refPointId, 	AdaptivePointConstraintType constraintType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetPointConstraintType ( _ 	doc As Document, _ 	refPointId As ElementId, _ 	constraintType As AdaptivePointConstraintType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetPointConstraintType( 	Document^ doc,  	ElementId^ refPointId,  	AdaptivePointConstraintType constraintType ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The Document

refPointId
:   Type:  Autodesk.Revit.DB ElementId
     The ReferencePoint id

constraintType
:   Type:  Autodesk.Revit.DB AdaptivePointConstraintType
     Constraint type of the Adaptive Shape Handle Point.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family. -or- The ElementId refPointId does not correspond to a Shape Handle Point. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation failed. |

# See Also

AdaptiveComponentFamilyUtils Class

Autodesk.Revit.DB Namespace

#### StructuralSectionGeneralT Constructor

---

|  |
| --- |
| StructuralSectionGeneralT Class   See Also |

Creates a new instance of Tees shape.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public StructuralSectionGeneralT( 	double width, 	double height, 	double flangeThickness, 	double flangeThicknessLocation, 	double flangeFillet, 	double flangeToeOfFillet, 	double slopedFlangeAngle, 	double webThickness, 	double webThicknessLocation, 	double webFillet, 	double topWebFillet, 	double webToeOfFillet, 	double slopedWebAngle, 	double centroidHorizontal, 	double centroidVertical, 	StructuralSectionAnalysisParams analysisParams ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	flangeThickness As Double, _ 	flangeThicknessLocation As Double, _ 	flangeFillet As Double, _ 	flangeToeOfFillet As Double, _ 	slopedFlangeAngle As Double, _ 	webThickness As Double, _ 	webThicknessLocation As Double, _ 	webFillet As Double, _ 	topWebFillet As Double, _ 	webToeOfFillet As Double, _ 	slopedWebAngle As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	analysisParams As StructuralSectionAnalysisParams _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionGeneralT( 	double width,  	double height,  	double flangeThickness,  	double flangeThicknessLocation,  	double flangeFillet,  	double flangeToeOfFillet,  	double slopedFlangeAngle,  	double webThickness,  	double webThicknessLocation,  	double webFillet,  	double topWebFillet,  	double webToeOfFillet,  	double slopedWebAngle,  	double centroidHorizontal,  	double centroidVertical,  	StructuralSectionAnalysisParams^ analysisParams ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

flangeThickness
:   Type:  System Double
     Flange Thickness.

flangeThicknessLocation
:   Type:  System Double
     Flange Thickness Location.

flangeFillet
:   Type:  System Double
     Flange Fillet - fillet radius at the flange end.

flangeToeOfFillet
:   Type:  System Double
     Detailing distance from center of web to flange toe of fillet, in. (mm)

slopedFlangeAngle
:   Type:  System Double
     Sloped flange angle. (rad)

webThickness
:   Type:  System Double
     Web Thickness.

webThicknessLocation
:   Type:  System Double
     Web Thickness Location.

webFillet
:   Type:  System Double
     Web Fillet - fillet radius between web and flange.

topWebFillet
:   Type:  System Double
     Top Web Fillet - fillet radius at the top of web.

webToeOfFillet
:   Type:  System Double
     Detailing distance from outer face of flange to web toe of fillet, in. (mm)

slopedWebAngle
:   Type:  System Double
     Sloped web angle. (rad)

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

analysisParams
:   Type:  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionAnalysisParams
     Common set of parameters for structural analysis.

# See Also

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### CannotCreateGeometryForPipe Property

---

|  |
| --- |
| BuiltInFailures PipingFailures Class   See Also |

Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateGeometryForPipe { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateGeometryForPipe As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateGeometryForPipe { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures PipingFailures Class

Autodesk.Revit.DB Namespace

#### IsValidIssue Method

---

|  |
| --- |
| TessellatedBuildIssue Class   See Also |

Reports whether the issue is well-formed, valid and does describe a real problem.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsValidIssue() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidIssue As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidIssue() ``` |

#### Return Value

Whether the issue is well formed and does describe a real problem.

# See Also

TessellatedBuildIssue Class

Autodesk.Revit.DB Namespace

#### IsSolidInView Method

---

|  |
| --- |
| Rebar Class   See Also |

Checks if this rebar element is shown solidly in a 3D view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The Rebar will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public bool IsSolidInView( 	View3D view ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The Rebar will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")> _ Public Function IsSolidInView ( _ 	view As View3D _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The Rebar will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public: bool IsSolidInView( 	View3D^ view ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View3D
     The 3D view element

#### Return Value

True if rebar is shown solidly, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar element doesn't have valid visibility data. |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### CommonButtons Property

---

|  |
| --- |
| TaskDialog Class   See Also |

The push buttons displayed in the task dialog.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TaskDialogCommonButtons CommonButtons { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CommonButtons As TaskDialogCommonButtons 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property TaskDialogCommonButtons CommonButtons { 	TaskDialogCommonButtons get (); 	void set (TaskDialogCommonButtons value); } ``` |

# Remarks

If no common button or CommandLink is added to the task dialog, the dialog will contain the Close common button by default.

Revit task dialogs are following these conventions for commit button usage:

* Use a single Close button instead of a single OK button on informational messages.
* Use a question at the end of the Main Instruction with a Yes/No combo (or Yes/No/Cancel) instead of OK/Cancel. This should work 99% of the time. For example: "Are you sure you want to overwrite the file?" and use Yes/No buttons.
* Do not customize the button names unless there is a very good reason to do so. For example, "Are you sure you want to save the file?" would use Yes/No buttons and not Save/No or Save/Cancel.

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### SetSurfaceNumber Method

---

|  |
| --- |
| DefaultDivideSettings Class   See Also |

Sets the default Divided Surface number for a fixed number layout for U or V gridlines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void SetSurfaceNumber( 	UVGridlineType gridlines, 	int number ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSurfaceNumber ( _ 	gridlines As UVGridlineType, _ 	number As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSurfaceNumber( 	UVGridlineType gridlines,  	int number ) ``` |

#### Parameters

gridlines
:   Type:  Autodesk.Revit.DB UVGridlineType
     U-gridlines or V-gridlines.

number
:   Type:  System Int32
     A default number for a fixed number layout.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for number is not positive. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DefaultDivideSettings Class

Autodesk.Revit.DB Namespace

#### PropertySetKeywords Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Keywords"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PropertySetKeywords { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PropertySetKeywords As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PropertySetKeywords { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VoltageTypeSet Class

---

|  |
| --- |
| Members   See Also |

A set that contains voltage types.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class VoltageTypeSet : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class VoltageTypeSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class VoltageTypeSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Electrical VoltageTypeSet

# See Also

VoltageTypeSet Members

Autodesk.Revit.DB.Electrical Namespace

#### SpotElevBase Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation Base"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpotElevBase { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotElevBase As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpotElevBase { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ScheduleField Class

---

|  |
| --- |
| Members   See Also |

A field in a schedule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class ScheduleField : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ScheduleField _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ScheduleField : IDisposable ``` |

# Remarks

The ScheduleField class represents a single field in a ScheduleDefinition's list of fields. Each (non-hidden) field becomes a column in the schedule.

Most commonly, a field represents an instance or type parameter of elements appearing in the schedule. Some fields represent parameters of other related elements, like the room that a scheduled element belongs to. Fields can also represent data calculated from other fields in the schedule, specifically Formula and Percentage fields.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ScheduleField

# See Also

ScheduleField Members

Autodesk.Revit.DB Namespace

#### ZeroLengthSegmentWarning Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

The solution is failing to do segments which are zero length.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ZeroLengthSegmentWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZeroLengthSegmentWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ZeroLengthSegmentWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### ReferenceLevel Property

---

|  |
| --- |
| MEPCurve Class   See Also |

The reference level of the MEP curve.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Level ReferenceLevel { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ReferenceLevel As Level 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Level^ ReferenceLevel { 	Level^ get (); 	void set (Level^ value); } ``` |

# Remarks

This property is used to retrieve the reference level of the MEP curve. If the curve is not in a horizontal plane, this value will be the start point's reference level.

# See Also

MEPCurve Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| WireConduitTypeSetIterator Class   See Also |

Bring the iterator back to the start of the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

WireConduitTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### GetLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Gets all the project layer modifiers from the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IList<LayerModifier> GetLayerModifiers() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLayerModifiers As IList(Of LayerModifier) ``` |

| Visual C++ |
| --- |
| ``` public: IList<LayerModifier^>^ GetLayerModifiers() ``` |

#### Return Value

The project layer modifier array.

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace

#### IsGreaterThan Method

---

|  |
| --- |
| MathComparisonUtils Class   See Also |

Checks if value1 is strictly greater than value2, using the internal tolerance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static bool IsGreaterThan( 	double value1, 	double value2 ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsGreaterThan ( _ 	value1 As Double, _ 	value2 As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsGreaterThan( 	double value1,  	double value2 ) ``` |

#### Parameters

value1
:   Type:  System Double
     The first value.

value2
:   Type:  System Double
     The second value.

#### Return Value

True if value1 is strictly greater than value2, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for value1 is not finite -or- The given value for value2 is not finite |

# See Also

MathComparisonUtils Class

Autodesk.Revit.DB Namespace

#### IFCGenericImportWarning Property

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   See Also |

The following problems were encountered in the IFC file: [Description]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId IFCGenericImportWarning { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IFCGenericImportWarning As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ IFCGenericImportWarning { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| LeaderArray Class   See Also |

Removes every item from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

LeaderArray Class

Autodesk.Revit.DB Namespace

#### TextBoxData Constructor

---

|  |
| --- |
| TextBoxData Class   See Also |

Constructs a new instance of TextBoxData.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TextBoxData( 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	name As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: TextBoxData( 	String^ name ) ``` |

#### Parameters

name
:   Type:  System String
     The internal name of the TextBoxData.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when    a null reference (  Nothing  in Visual Basic)  is passed for name. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when an empty string is passed for name. |

# See Also

TextBoxData Class

Autodesk.Revit.UI Namespace

#### ApplyTo Property

---

|  |
| --- |
| StructuralConnectionType Class   See Also |

Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public StructuralConnectionApplyTo ApplyTo { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApplyTo As StructuralConnectionApplyTo 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralConnectionApplyTo ApplyTo { 	StructuralConnectionApplyTo get (); } ``` |

# Remarks

The property cannot be changed. Create a new StructuralConnectionType if a different value is needed.

# See Also

StructuralConnectionType Class

Autodesk.Revit.DB.Structure Namespace

#### DockPosition Property

---

|  |
| --- |
| DockablePaneState Class   See Also |

Which part of the Revit application frame the pane should dock to.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public DockPosition DockPosition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DockPosition As DockPosition 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property DockPosition DockPosition { 	DockPosition get (); 	void set (DockPosition value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

DockablePaneState Class

Autodesk.Revit.UI Namespace

#### ExternallyTaggedGeometryValidation Class

---

|  |
| --- |
| Members   See Also |

Provides validation for geometry to be stored in an ExternallyTaggedGeometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static class ExternallyTaggedGeometryValidation ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class ExternallyTaggedGeometryValidation ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternallyTaggedGeometryValidation abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExternallyTaggedGeometryValidation

# See Also

ExternallyTaggedGeometryValidation Members

Autodesk.Revit.DB Namespace

#### SetLayoutAsNumberWithSpacing Method

---

|  |
| --- |
| RebarShapeDrivenAccessor Class   See Also |

Sets the Layout Rule property of rebar set to NumberWithSpacing

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void SetLayoutAsNumberWithSpacing( 	int numberOfBarPositions, 	double spacing, 	bool barsOnNormalSide, 	bool includeFirstBar, 	bool includeLastBar ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayoutAsNumberWithSpacing ( _ 	numberOfBarPositions As Integer, _ 	spacing As Double, _ 	barsOnNormalSide As Boolean, _ 	includeFirstBar As Boolean, _ 	includeLastBar As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayoutAsNumberWithSpacing( 	int numberOfBarPositions,  	double spacing,  	bool barsOnNormalSide,  	bool includeFirstBar,  	bool includeLastBar ) ``` |

#### Parameters

numberOfBarPositions
:   Type:  System Int32
     The number of bar positions in rebar set

spacing
:   Type:  System Double
     The maximum spacing between rebar in rebar set

barsOnNormalSide
:   Type:  System Boolean
     Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal

includeFirstBar
:   Type:  System Boolean
     Identifies if the first bar in rebar set is shown

includeLastBar
:   Type:  System Boolean
     Identifies if the last bar in rebar set is shown

# Remarks

When changing the layout rule to NumberWithSpacing, you must also simultaneously set NumberOfBarPositions, Spacing, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the number of bar positions numberOfBarPositions is less than 1 or more than 1002. -or- The spacing isn't bigger than 0.0. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape. |
| Autodesk.Revit.Exceptions InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### Stage Property

---

|  |
| --- |
| ProgressChangedEventArgs Class   See Also |

The current stage of the progress bar

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ProgressStage Stage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Stage As ProgressStage 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ProgressStage Stage { 	ProgressStage get (); } ``` |

# See Also

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### SetUnits Method

---

|  |
| --- |
| AnalysisResultSchema Class   Example   See Also |

Sets names and multipliers of all units for result visualization

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void SetUnits( 	IList<string> names, 	IList<double> multipliers ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetUnits ( _ 	names As IList(Of String), _ 	multipliers As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetUnits( 	IList<String^>^ names,  	IList<double>^ multipliers ) ``` |

#### Parameters

names
:   Type:  System.Collections.Generic IList   String
     Unit names for all units (e.g., "Lb" and "Kg")

multipliers
:   Type:  System.Collections.Generic IList   Double
     Numerical coefficients mapped to unit names. They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)

# Examples

 Copy  C#

```
IList<string> unitNames = new List<string>();
unitNames.Add("Feet");
unitNames.Add("Inches");
IList<double> multipliers = new List<double>();
multipliers.Add(1);
multipliers.Add(12);

AnalysisResultSchema resultSchema = new AnalysisResultSchema("Schema Name", "Description");

resultSchema.SetUnits(unitNames, multipliers);
```

 Copy  VB.NET

```
Dim unitNames As IList(Of String) = New List(Of String)()
unitNames.Add("Feet")
unitNames.Add("Inches")
Dim multipliers As IList(Of Double) = New List(Of Double)()
multipliers.Add(1)
multipliers.Add(12)

Dim resultSchema As New AnalysisResultSchema("Schema Name", "Description")

resultSchema.SetUnits(unitNames, multipliers)
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | names is zero-length or contains duplicate or empty names -or- multipliers contains non-positive numbers, or its length is not equal to the length of names |

# See Also

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace

#### IsValidObject Property

---

|  |
| --- |
| TessellatedFace Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

TessellatedFace Class

Autodesk.Revit.DB Namespace

#### ServerPath Constructor

---

|  |
| --- |
| ServerPath Class   See Also |

Constructs a ServerPath

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ServerPath( 	string centralServerLocation, 	string path ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	centralServerLocation As String, _ 	path As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ServerPath( 	String^ centralServerLocation,  	String^ path ) ``` |

#### Parameters

centralServerLocation
:   Type:  System String
     The name of the central Revit server

path
:   Type:  System String
     The path of the model. This path must be relative.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ServerPath Class

Autodesk.Revit.DB Namespace

#### SortPoints Method

---

|  |
| --- |
| CurveByPoints Class   See Also |

Order a set of ReferencePoints in the same way Revit does when creating a curve from points.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool SortPoints( 	ReferencePointArray arr ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function SortPoints ( _ 	arr As ReferencePointArray _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool SortPoints( 	ReferencePointArray^ arr ) ``` |

#### Parameters

arr
:   Type:  Autodesk.Revit.DB ReferencePointArray
     An array of ReferencePoints. The array is reordered if sortPoints returns true, and is unchanged if sortPoints returns false.

#### Return Value

False if the least-squares method is unable to find a solution; true otherwise.

# Remarks

Finds a best-fit line to the points by the least squares method, and orders the points by their projection onto the line.

# See Also

CurveByPoints Class

Autodesk.Revit.DB Namespace

#### MismatchNmbAssignedDistSysToCircuit Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MismatchNmbAssignedDistSysToCircuit As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MismatchNmbAssignedDistSysToCircuit { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### AddSegment Method

---

|  |
| --- |
| SlabEdge Class   See Also |

Add segments to the slab edge.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void AddSegment( 	Reference targetRef ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub AddSegment ( _ 	targetRef As Reference _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void AddSegment( 	Reference^ targetRef ) override ``` |

#### Parameters

targetRef
:   Type:  Autodesk.Revit.DB Reference
     Segment's reference on which want to be added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | This exception will be thrown in following cases: 1. Input targetRef is    a null reference (  Nothing  in Visual Basic)  . 2. Input targetRef is not    a null reference (  Nothing  in Visual Basic)  but contains nothing. |
| Autodesk.Revit.Exceptions InvalidOperationException | This exception will be thrown in following cases: 1. Input targetRef has already been added into the slab edge. 2. Internal code fails to create the segment object. 3. Regeneration fails. |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | This exception will be thrown if the reference is suitable for creating a slab edge as required. The reference allowed is : 1. Model Line 2. Floor's horizontal edges 3. Other slab edge's horizontal edges |

# See Also

SlabEdge Class

Autodesk.Revit.DB Namespace

#### RoofUptoLevelOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cutoff Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoofUptoLevelOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoofUptoLevelOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoofUptoLevelOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetStatus Method

---

|  |
| --- |
| SubTransaction Class   See Also |

Returns the current status of the sub-transaction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionStatus GetStatus() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetStatus As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus GetStatus() ``` |

#### Return Value

The current status of the sub-transaction.

# See Also

SubTransaction Class

Autodesk.Revit.DB Namespace

#### IsWallCrossSectionValid Method

---

|  |
| --- |
| Wall Class   See Also |

Checks whether the desired cross section is valid for the current wall.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool IsWallCrossSectionValid( 	WallCrossSection wallCrossSection ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsWallCrossSectionValid ( _ 	wallCrossSection As WallCrossSection _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsWallCrossSectionValid( 	WallCrossSection wallCrossSection ) ``` |

#### Parameters

wallCrossSection
:   Type:  Autodesk.Revit.DB WallCrossSection
     The desired cross section.

#### Return Value

True if the wall can be set to the desired cross section.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

Wall Class

Autodesk.Revit.DB Namespace

#### Print Method (ViewSet, View)

---

|  |
| --- |
| Document Class   See Also |

Prints a set of views with a specified view template and default print settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Print( 	ViewSet views, 	View viewTemplate ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Print ( _ 	views As ViewSet, _ 	viewTemplate As View _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Print( 	ViewSet^ views,  	View^ viewTemplate ) ``` |

#### Parameters

views
:   Type:  Autodesk.Revit.DB ViewSet
     The set of views which need to be printed.

viewTemplate
:   Type:  Autodesk.Revit.DB View
     The view template which apply to the set of views.

# Remarks

If one view in the set can not be printed successfully then an exception will be thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the view set to be printed is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the view set contains a    a null reference (  Nothing  in Visual Basic)  element. |
| Autodesk.Revit.Exceptions ApplicationException | Thrown when at least one view from the view set could not be printed. |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when print is cancelled by event handler. |

# See Also

Document Class

Print Overload

Autodesk.Revit.DB Namespace

#### KilogramsPerMeterSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilograms per meter second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KilogramsPerMeterSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KilogramsPerMeterSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KilogramsPerMeterSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### PartMakerSplitterProfileEdgeMatch Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Edge Match"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PartMakerSplitterProfileEdgeMatch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PartMakerSplitterProfileEdgeMatch As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PartMakerSplitterProfileEdgeMatch { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralCopingDistance Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Coping Distance"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralCopingDistance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralCopingDistance As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralCopingDistance { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetSubelement Method (Reference)

---

|  |
| --- |
| Document Class   See Also |

Gets the subelement referenced by the input reference.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public Subelement GetSubelement( 	Reference reference ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSubelement ( _ 	reference As Reference _ ) As Subelement ``` |

| Visual C++ |
| --- |
| ``` public: Subelement^ GetSubelement( 	Reference^ reference ) ``` |

#### Parameters

reference
:   Type:  Autodesk.Revit.DB Reference
     The reference that identifies element or subelement.

#### Return Value

The subelement referenced by the input argument.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | reference does not identify a valid element or subelement. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Document Class

GetSubelement Overload

Autodesk.Revit.DB Namespace

#### Location Class

---

|  |
| --- |
| Members   Example   See Also |

Provides location functionality for all elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class Location : APIObject ``` |

| Visual Basic |
| --- |
| ``` Public Class Location _ 	Inherits APIObject ``` |

| Visual C++ |
| --- |
| ``` public ref class Location : public APIObject ``` |

# Remarks

The location object provides the ability to translate and rotate elements. More detailed location information and control can be found by using the derivatives of this object, such as LocationPoint or LocationCurve.

# Examples

 Copy  C#

```
void ShowLocationUsage(Autodesk.Revit.ApplicationServices.Application application, Wall wall)
{
    // Get the location instance.
    Autodesk.Revit.DB.Location position = wall.Location;

    // Check whether the wall is pinned.
    if (wall.Pinned)
    {
        throw new Exception("The wall has been pinned.");
    }

    // Move the wall location, it provides same function as Move method of Document class.
    XYZ direction = new XYZ(10, 0, 0);
    bool result = position.Move(direction);
    if (!result)
    {
        throw new Exception("Move wall location failed.");
    }

    // Rotate the wall location, it provides same function as Rotate method of Document class.
    XYZ axisStart = new XYZ(0, 0, 0);
    XYZ axisEnd = new XYZ(0, 0, 1);
    Line axis = Line.CreateUnbound(axisStart, axisEnd);
    result = position.Rotate(axis, 30);
    if (!result)
    {
        throw new Exception("Rotate wall location failed.");
    }
}
```

 Copy  VB.NET

```
Private Sub ShowLocationUsage(application As Autodesk.Revit.ApplicationServices.Application, wall As Wall)
    ' Get the location instance.
    Dim position As Autodesk.Revit.DB.Location = wall.Location

    ' Check whether the wall is pinned.
    If wall.Pinned Then
        Throw New Exception("The wall has been pinned.")
    End If

    ' Move the wall location, it provides same function as Move method of Document class.
    Dim direction As New XYZ(10, 0, 0)
    Dim result As Boolean = position.Move(direction)
    If Not result Then
        Throw New Exception("Move wall location failed.")
    End If

    ' Rotate the wall location, it provides same function as Rotate method of Document class.
    Dim axisStart As New XYZ(0, 0, 0)
    Dim axisEnd As New XYZ(0, 0, 1)
    Dim axis As Line = Line.CreateUnbound(axisStart, axisEnd)
    result = position.Rotate(axis, 30)
    If Not result Then
        Throw New Exception("Rotate wall location failed.")
    End If
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB Location
  Autodesk.Revit.DB LocationCurve
  Autodesk.Revit.DB LocationPoint

# See Also

Location Members

Autodesk.Revit.DB Namespace

#### StorageType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all of the internal parameter data storage types that Autodesk Revit supports.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum StorageType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StorageType ``` |

| Visual C++ |
| --- |
| ``` public enum class StorageType ``` |

# Members

| Member name | Description |
| --- | --- |
| None | None represents an invalid storage type. This value should not be used. |
| Integer | The internal data is stored in the form of a signed 32 bit integer. |
| Double | The data will be stored internally in the form of an 8 byte floating point number. |
| String | The internal data will be stored in the form of a string of characters. |
| ElementId | The data type represents an element and is stored as the id of the element. |

# See Also

Autodesk.Revit.DB Namespace

#### CutLineType Enumeration

---

|  |
| --- |
| See Also |

The available line types for a stairs cut line.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum CutLineType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CutLineType ``` |

| Visual C++ |
| --- |
| ``` public enum class CutLineType ``` |

# Members

| Member name | Description |
| --- | --- |
| SingleLine | Cutline type is single-line. |
| DoubleLine | Cutline type is double-line. |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### IFCFileReadOptions Class

---

|  |
| --- |
| Members   See Also |

This class contains options to read an IFC file.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class IFCFileReadOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class IFCFileReadOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class IFCFileReadOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.IFC IFCFileReadOptions

# See Also

IFCFileReadOptions Members

Autodesk.Revit.DB.IFC Namespace

#### Hour Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol h, indicating unit Hours.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Hour { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Hour As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Hour { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RbsCurvetypeDefaultTeeupParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tee Up"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCurvetypeDefaultTeeupParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCurvetypeDefaultTeeupParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCurvetypeDefaultTeeupParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MSup6 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol mâ¶, indicating unit Meters to the sixth power.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MSup6 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MSup6 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MSup6 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FaceArrayIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a face array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class FaceArrayIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class FaceArrayIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class FaceArrayIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB FaceArrayIterator

# See Also

FaceArrayIterator Members

Autodesk.Revit.DB Namespace

#### NumericRevisionSettings Class

---

|  |
| --- |
| Members   See Also |

Contains settings that apply to Revisions with the Numeric RevisionNumberType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class NumericRevisionSettings : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class NumericRevisionSettings _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class NumericRevisionSettings : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB NumericRevisionSettings

# See Also

NumericRevisionSettings Members

Autodesk.Revit.DB Namespace

#### AllowOverrideCellStyle Method

---

|  |
| --- |
| TableSectionData Class   See Also |

Identifies if the style can be overridden in the given cell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool AllowOverrideCellStyle( 	int nRow, 	int nCol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AllowOverrideCellStyle ( _ 	nRow As Integer, _ 	nCol As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AllowOverrideCellStyle( 	int nRow,  	int nCol ) ``` |

#### Parameters

nRow
:   Type:  System Int32

nCol
:   Type:  System Int32

#### Return Value

True if allow to override cell style.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. |

# See Also

TableSectionData Class

Autodesk.Revit.DB Namespace

#### RollBack Method

---

|  |
| --- |
| SubTransaction Class   See Also |

Discards all changes made to the model during the sub-transaction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionStatus RollBack() ``` |

| Visual Basic |
| --- |
| ``` Public Function RollBack As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus RollBack() ``` |

#### Return Value

If finished successfully, this method returns TransactionStatus.RolledBack.

# Remarks

The parent transaction (or a parent sub-transaction, if any) can still be committed, but the changes rolled back by this method will not be part of the committed transaction.

RollBack can be called only when all inner sub-transaction, if any, are finished, i.e. they were either committed or rolled back. If there is still a sub-transaction open, an attempt to roll this outer sub-transaction back will cause an exception.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | A sub-transaction can only be active inside an open Transaction. -or- The sub-transaction's current status is not TransactionStatus.Started, therefore it may not be committed or rolled back. |

# See Also

SubTransaction Class

Autodesk.Revit.DB Namespace

#### SetSurfaceBackgroundPatternId Method

---

|  |
| --- |
| OverrideGraphicSettings Class   See Also |

Sets the ElementId of the surface background pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public OverrideGraphicSettings SetSurfaceBackgroundPatternId( 	ElementId fillPatternId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetSurfaceBackgroundPatternId ( _ 	fillPatternId As ElementId _ ) As OverrideGraphicSettings ``` |

| Visual C++ |
| --- |
| ``` public: OverrideGraphicSettings^ SetSurfaceBackgroundPatternId( 	ElementId^ fillPatternId ) ``` |

#### Parameters

fillPatternId
:   Type:  Autodesk.Revit.DB ElementId
     Value of the surface background fill pattern override.

#### Return Value

Reference to the changed object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

OverrideGraphicSettings Class

Autodesk.Revit.DB Namespace

#### NoSketchPlane Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't paste because no Work Plane is defined in the View.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoSketchPlane { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoSketchPlane As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoSketchPlane { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### MassDataPercentageSkylights Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Target Percentage Skylights"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MassDataPercentageSkylights { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MassDataPercentageSkylights As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MassDataPercentageSkylights { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| CopyPasteOptions Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

CopyPasteOptions Class

Autodesk.Revit.DB Namespace

#### ExportDGNSettings Class

---

|  |
| --- |
| Members   See Also |

This element contains DGN export settings which are saved in a Revit document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class ExportDGNSettings : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportDGNSettings _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportDGNSettings : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ExportDGNSettings

# See Also

ExportDGNSettings Members

Autodesk.Revit.DB Namespace

#### SketchGalleryOptions Enumeration

---

|  |
| --- |
| See Also |

Enumerates all the sketch options.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public enum SketchGalleryOptions ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SketchGalleryOptions ``` |

| Visual C++ |
| --- |
| ``` public enum class SketchGalleryOptions ``` |

# Members

| Member name | Description |
| --- | --- |
| SGO\_Default | The default option which means the real option is decided by Revit internally. |
| SGO\_Line | Sketch a line. |
| SGO\_Rect | Sketch a rectangle. |
| SGO\_InscribedPolygon | Sketch an inscribed polygon. |
| SGO\_CircumscribedPolygon | Sketch a circumscribed polygon. |
| SGO\_Circle | Sketch a circle. |
| SGO\_Arc3Point | Sketch a Start-End-Radius arc. |
| SGO\_ArcCenterEnds | Sketch a Center-Ends arc. |
| SGO\_ArcTanEnd | Sketch a Tangent-End arc. |
| SGO\_ArcFillet | Sketch a fillet arc. |
| SGO\_Spline | Sketch a spline. |
| SGO\_SplineByPoints | Sketch a spline by points. |
| SGO\_FullEllipse | Sketch a full ellipse. |
| SGO\_PartialEllipse | Sketch a partial ellipse. |
| SGO\_PickLines | Pick lines. |
| SGO\_PickFaces | Pick faces. |
| SGO\_PickWalls | Pick walls. |
| SGO\_PickSupports | Pick supports. |
| SGO\_PickRoofs | Pick roofs. |
| SGO\_Point | Pick a point. |
| SGO\_PickPoints | Pick points. |
| SGO\_PointElement | Pick point element. |
| SGO\_RunLine | Sketch a line for a run of stairs. |
| SGO\_RunArcFullStep | Sketch a Full-Step spiral for a run of stairs. |
| SGO\_RunArcCenterEnds | Sketch a Center-Ends spiral for a run of stairs. |
| SGO\_LandingSquare | Sketch a landing square. |
| SGO\_WinderLShape | Sketch a L-Shape winder. |
| SGO\_WinderPattern | Pick winder pattern. |
| SGO\_SupportPickLine | Pick a line to create a support. |
| SGO\_WinderUShape | Sketch a U-Shape winder. |
| SGO\_LandingWithTwoRuns | Pick two runs to create a landing. |
| SGO\_SketchRun | Sketch a run. |
| SGO\_SketchLanding | Sketch a landing. |

# See Also

Autodesk.Revit.UI Namespace

#### Create Method

---

|  |
| --- |
| HVACLoadBuildingType Class   See Also |

Creates a building type element.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static HVACLoadBuildingType Create( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String _ ) As HVACLoadBuildingType ``` |

| Visual C++ |
| --- |
| ``` public: static HVACLoadBuildingType^ Create( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

name
:   Type:  System String
     The building type name.

#### Return Value

The new building type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a building type name. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

HVACLoadBuildingType Class

Autodesk.Revit.DB.Analysis Namespace

#### TotalViews Property

---

|  |
| --- |
| ViewPrintingEventArgs Class   See Also |

The number of all views being printed.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public int TotalViews { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TotalViews As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int TotalViews { 	int get (); } ``` |

# See Also

ViewPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### SpaceHeatingSetPoint Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Heating Set Point"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpaceHeatingSetPoint { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpaceHeatingSetPoint As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpaceHeatingSetPoint { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RailProfileOpen Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Open Profile Loop can't be used as a Rail Profile

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailProfileOpen { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailProfileOpen As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailProfileOpen { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### NumberOfSegments Property

---

|  |
| --- |
| Dimension Class   See Also |

The number of segments for the dimension.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int NumberOfSegments { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfSegments As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int NumberOfSegments { 	int get (); } ``` |

# See Also

Dimension Class

Autodesk.Revit.DB Namespace

#### MSup2KPerW Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol (mÂ²Â·K)/W, indicating unit Square meter kelvins per watt.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MSup2KPerW { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MSup2KPerW As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MSup2KPerW { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### AsElementId Method

---

|  |
| --- |
| Parameter Class   See Also |

Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId AsElementId() ``` |

| Visual Basic |
| --- |
| ``` Public Function AsElementId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ AsElementId() ``` |

#### Return Value

The Autodesk::Revit::DB::ElementId^ contained in the parameter.

# Remarks

The AsAutodesk::Revit::DB::ElementId^ method should only be used if the StorageType property returns that the internal contents of the parameter is an ElementId.

# See Also

Parameter Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamExpCoeff1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Thermal expansion coefficient X"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamExpCoeff1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamExpCoeff1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamExpCoeff1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Smoothness Property

---

|  |
| --- |
| MaterialNode Class   See Also |

The level of smoothness of the material.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int Smoothness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Smoothness As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int Smoothness { 	int get (); } ``` |

# See Also

MaterialNode Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamYoungModn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Young's Modulus 2"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamYoungModn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamYoungModn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamYoungModn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DatumPlane Class

---

|  |
| --- |
| Members   See Also |

A base class representing a datum surface (level, grid or reference plane) in Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class DatumPlane : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class DatumPlane _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class DatumPlane : public Element ``` |

# Remarks

A DatumPlane represents a 3d surface with finite extents. It can be either a rectangle with arbitrary orientation, or a cylinder whose axis is parallel to the project z-axis. If a datum is visible in a plan or section view, it will be displayed as one or more curves. These curves are determined by the intersection of the datum surface with the cut plane of the view. By default, the extents of these curves reflect the 3d extents of the datum surface. If the surface is a plane, then the extents represent the projection of the surface onto the cut plane. This matters, for example, when viewing a datum plane, really a 3d rectangle, along one of its diagonals. The extents of the curve do not vary with the location of the view, because we use the projection of the rectangle and not the actual intersection. If the surface is a cylinder, then the extents reflect the actual intersection of the surface with the cut plane. In addition, the curves that represent a DatumPlane can be modified on a view specific basis. In this case, the ends of the curve no longer reflect the 3d extents of the datum.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB DatumPlane
  Autodesk.Revit.DB Grid
  Autodesk.Revit.DB Level
  Autodesk.Revit.DB ReferencePlane

# See Also

DatumPlane Members

Autodesk.Revit.DB Namespace

#### Latitude Property

---

|  |
| --- |
| City Class   See Also |

Latitude of the city

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Latitude { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Latitude As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Latitude { 	double get (); } ``` |

# Remarks

A read only property that contains the latitude of the city. The value returned is in radians, ranging from -PI to +PI.

# See Also

City Class

Autodesk.Revit.DB Namespace

#### Flipped Property

---

|  |
| --- |
| Railing Class   See Also |

Indicates if the railing is flipped.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool Flipped { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Flipped As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool Flipped { 	bool get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | The railing has incorrect internal data. |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### Contains Method

---

|  |
| --- |
| Outline Class   See Also |

Determine if this Outline contains the specified point to within a tolerance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool Contains( 	XYZ point, 	double tolerance ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Contains ( _ 	point As XYZ, _ 	tolerance As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Contains( 	XYZ^ point,  	double tolerance ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB XYZ
     The point to test for containment.

tolerance
:   Type:  System Double
     The tolerance to use when determining whether the point is contained. Defaults to zero.

#### Return Value

True if this outline contains the given point, or false otherwise.

# Remarks

If the tolerance is positive, the point may lie up to the tolerance amount outside the outline in each coordinate. If the tolerance is negative, the point must lie at least the tolerance amount inside the outline in each coordinate.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Outline Class

Autodesk.Revit.DB Namespace

#### CannotCopyTag Property

---

|  |
| --- |
| BuiltInFailures TagFailures Class   See Also |

A tag cannot be arrayed without copying the associated element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyTag { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyTag As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyTag { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures TagFailures Class

Autodesk.Revit.DB Namespace

#### RoofConstraintOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Level Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RoofConstraintOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RoofConstraintOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RoofConstraintOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotKeepWallJoinToRoof Property

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   See Also |

Can't keep wall and [target] joined

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotKeepWallJoinToRoof { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotKeepWallJoinToRoof As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotKeepWallJoinToRoof { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace

#### UIView Property

---

|  |
| --- |
| PreviewControl Class   See Also |

The UI view representing the preview view.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public UIView UIView { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property UIView As UIView 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property UIView^ UIView { 	UIView^ get (); } ``` |

# Remarks

Use this handle to manipulate the zoom and pan of the view.

# See Also

PreviewControl Class

Autodesk.Revit.UI Namespace

#### ZoneLevelOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Level Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ZoneLevelOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ZoneLevelOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ZoneLevelOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InverseKilonewtons Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Inverse kilonewtons.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId InverseKilonewtons { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InverseKilonewtons As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ InverseKilonewtons { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### OperatorType Property

---

|  |
| --- |
| FilterOperatorAndTextString Class   See Also |

The filter operator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public ScheduleFilterType OperatorType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property OperatorType As ScheduleFilterType 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ScheduleFilterType OperatorType { 	ScheduleFilterType get (); } ``` |

# See Also

FilterOperatorAndTextString Class

Autodesk.Revit.DB Namespace

#### ForwardIterator Method

---

|  |
| --- |
| GroupSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual GroupSetIterator ForwardIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function ForwardIterator As GroupSetIterator ``` |

| Visual C++ |
| --- |
| ``` public: virtual GroupSetIterator^ ForwardIterator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

# See Also

GroupSet Class

Autodesk.Revit.DB Namespace

#### CircularDependencySketchError Property

---

|  |
| --- |
| BuiltInFailures RegenFailures Class   See Also |

There is a circular chain of references among the highlighted elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CircularDependencySketchError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CircularDependencySketchError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CircularDependencySketchError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RegenFailures Class

Autodesk.Revit.DB Namespace

#### GetExtrusionBase Method

---

|  |
| --- |
| ExtrusionAnalyzer Class   See Also |

Obtains the face that represents the base contour of the extrusion analysis.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Face GetExtrusionBase() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetExtrusionBase As Face ``` |

| Visual C++ |
| --- |
| ``` public: Face^ GetExtrusionBase() ``` |

#### Return Value

The face that represents the base contour.

# See Also

ExtrusionAnalyzer Class

Autodesk.Revit.DB Namespace

#### ViewDisplayEdges Enumeration

---

|  |
| --- |
| See Also |

A collection of settings defining how visible edges are displayed

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum ViewDisplayEdges ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ViewDisplayEdges ``` |

| Visual C++ |
| --- |
| ``` public enum class ViewDisplayEdges ``` |

# Members

| Member name | Description |
| --- | --- |
| None | The edges are invisible |
| Simple | The edges are visible and drawn according to style |

# See Also

Autodesk.Revit.DB Namespace

#### LeaderRightAttachment Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Right Attachment"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LeaderRightAttachment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LeaderRightAttachment As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LeaderRightAttachment { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### BuildingPadNotConnected Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

Can't create a single Pad with several connected regions.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId BuildingPadNotConnected { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BuildingPadNotConnected As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ BuildingPadNotConnected { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### RbsPipeSlopeOptionsDefParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Pipe Slope Options"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeSlopeOptionsDefParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeSlopeOptionsDefParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeSlopeOptionsDefParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MasonryCMUPattern Property

---

|  |
| --- |
| MasonryCMU Class   See Also |

The property labeled "Relief Pattern" from the "MasonryCMU" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string MasonryCMUPattern { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MasonryCMUPattern As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ MasonryCMUPattern { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".

# See Also

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace

#### GetLineStyleIds Method

---

|  |
| --- |
| CurveElement Class   See Also |

Ids of all line style Elements that are applicable to this curve element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetLineStyleIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLineStyleIds As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetLineStyleIds() ``` |

#### Return Value

A collection of Ids of line style elements.

# Remarks

The elements are of the  GraphicsStyle  class.

# See Also

CurveElement Class

Autodesk.Revit.DB Namespace

#### LogicalAndFilter Class

---

|  |
| --- |
| Members   Example   See Also |

A filter that contains a set of filters. The filter passes when all filters in the set pass.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class LogicalAndFilter : ElementLogicalFilter ``` |

| Visual Basic |
| --- |
| ``` Public Class LogicalAndFilter _ 	Inherits ElementLogicalFilter ``` |

| Visual C++ |
| --- |
| ``` public ref class LogicalAndFilter : public ElementLogicalFilter ``` |

# Remarks

The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.

# Examples

 Copy  C#

```
// Find all door instances in the project by finding all elements that both belong to the door
// category and are family instances.
ElementClassFilter familyInstanceFilter = new ElementClassFilter(typeof(FamilyInstance));

// Create a category filter for Doors
ElementCategoryFilter doorsCategoryfilter = new ElementCategoryFilter(BuiltInCategory.OST_Doors);

// Create a logic And filter for all Door FamilyInstances
LogicalAndFilter doorInstancesFilter = new LogicalAndFilter(familyInstanceFilter, doorsCategoryfilter);

// Apply the filter to the elements in the active document
FilteredElementCollector collector = new FilteredElementCollector(document);
IList<Element> doors = collector.WherePasses(doorInstancesFilter).ToElements();
```

 Copy  VB.NET

```
' Find all door instances in the project by finding all elements that both belong to the door
' category and are family instances.
Dim familyInstanceFilter As New ElementClassFilter(GetType(FamilyInstance))

' Create a category filter for Doors
Dim doorsCategoryfilter As New ElementCategoryFilter(BuiltInCategory.OST_Doors)

' Create a logic And filter for all Door FamilyInstances
Dim doorInstancesFilter As New LogicalAndFilter(familyInstanceFilter, doorsCategoryfilter)

' Apply the filter to the elements in the active document
Dim collector As New FilteredElementCollector(document)
Dim doors As IList(Of Element) = collector.WherePasses(doorInstancesFilter).ToElements()
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ElementFilter
  Autodesk.Revit.DB ElementLogicalFilter
  Autodesk.Revit.DB LogicalAndFilter

# See Also

LogicalAndFilter Members

Autodesk.Revit.DB Namespace

#### RebarSystemLayerSummaryWithSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Layer Summary"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemLayerSummaryWithSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemLayerSummaryWithSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemLayerSummaryWithSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TrapMullWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Center Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TrapMullWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrapMullWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TrapMullWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CentralModelAccessDeniedException Class

---

|  |
| --- |
| Members   See Also |

The exceptions thrown when a central model can be reached but access is denied due to a lack of access privileges.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` [SerializableAttribute] public class CentralModelAccessDeniedException : CentralModelException ``` |

| Visual Basic |
| --- |
| ``` <SerializableAttribute> _ Public Class CentralModelAccessDeniedException _ 	Inherits CentralModelException ``` |

| Visual C++ |
| --- |
| ``` [SerializableAttribute] public ref class CentralModelAccessDeniedException : public CentralModelException ``` |

# Inheritance Hierarchy

System Object
  System Exception
  Autodesk.Revit.Exceptions ApplicationException
  Autodesk.Revit.Exceptions CentralModelException
  Autodesk.Revit.Exceptions CentralModelAccessDeniedException

# See Also

CentralModelAccessDeniedException Members

Autodesk.Revit.Exceptions Namespace

#### CurtaingridBeltn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Measurement Line"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtaingridBeltn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtaingridBeltn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtaingridBeltn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LinePattern Constructor

---

|  |
| --- |
| LinePattern Class   See Also |

Creates a simple line pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public LinePattern() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: LinePattern() ``` |

# See Also

LinePattern Class

LinePattern Overload

Autodesk.Revit.DB Namespace

#### RbsCtcTopElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Upper End Top Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCtcTopElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCtcTopElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCtcTopElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SurfaceExists Property

---

|  |
| --- |
| BuiltInFailures SiteImportFailures Class   See Also |

You are importing data into a surface that already contains points. You may want to go back, create a new surface, and import the data into that instead. You can continue, and Revit will sew the meshes together, but the boundary may be larger than you want.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SurfaceExists { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceExists As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SurfaceExists { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteImportFailures Class

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| ExportLinetypeTableIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

ExportLinetypeTableIterator Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| RebarContainerIterator Class   See Also |

Resets the iterator to the initial state.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

# See Also

RebarContainerIterator Class

Autodesk.Revit.DB.Structure Namespace

#### RasterSymbolPixelwidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width (pixels)"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RasterSymbolPixelwidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RasterSymbolPixelwidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RasterSymbolPixelwidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DWGExportOptions Class

---

|  |
| --- |
| Members   See Also |

The export options used by exporting DWG format file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class DWGExportOptions : ACADExportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class DWGExportOptions _ 	Inherits ACADExportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class DWGExportOptions : public ACADExportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BaseExportOptions
  Autodesk.Revit.DB ACADExportOptions
  Autodesk.Revit.DB DWGExportOptions

# See Also

DWGExportOptions Members

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Releases all resources used by the  ScheduleDefinition

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### RebarShapeEndHookOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"End Hook Offset Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarShapeEndHookOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarShapeEndHookOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarShapeEndHookOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetDoubleValue Method

---

|  |
| --- |
| ColorFillSchemeEntry Class   See Also |

Sets new Double value of entry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetDoubleValue( 	double value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDoubleValue ( _ 	value As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDoubleValue( 	double value ) ``` |

#### Parameters

value
:   Type:  System Double

# Remarks

You should only use this method if the  StorageType  property reports the type of the entry as a Double.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The entry has different storage type with Double, or value is not finite. |

# See Also

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace

#### CreatePointSetIterator Method (PointCloudFilter, ElementId)

---

|  |
| --- |
| IPointCloudAccess Interface   See Also |

Implement this method to return an iterator for iterating over blocks of this point cloud.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` IPointSetIterator CreatePointSetIterator( 	PointCloudFilter rFilter, 	ElementId viewId ) ``` |

| Visual Basic |
| --- |
| ``` Function CreatePointSetIterator ( _ 	rFilter As PointCloudFilter, _ 	viewId As ElementId _ ) As IPointSetIterator ``` |

| Visual C++ |
| --- |
| ``` IPointSetIterator^ CreatePointSetIterator( 	PointCloudFilter^ rFilter,  	ElementId^ viewId ) ``` |

#### Parameters

rFilter
:   Type:  Autodesk.Revit.DB.PointClouds PointCloudFilter
     The filter used to process cloud points and determine which ones lie with the target volume.

viewId
:   Type:  Autodesk.Revit.DB ElementId
     The view id for the current view passed as auxiliary information to allow the engine to optimize retrieval of points. If viewId == InvalidElementId, the query is not for a view display operation.

#### Return Value

The newly created iterator.

# See Also

IPointCloudAccess Interface

CreatePointSetIterator Overload

Autodesk.Revit.DB.PointClouds Namespace

#### Wattage Property

---

|  |
| --- |
| InitialWattageIntensity Class   See Also |

The wattage value.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Wattage { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Wattage As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Wattage { 	double get (); 	void set (double value); } ``` |

#### Field Value

The wattage value in W as a numerical value between 0 and 1e+30.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The wattage value is not valid because it is not between 0 and 1e+30. |

# See Also

InitialWattageIntensity Class

Autodesk.Revit.DB.Lighting Namespace

#### IsValidObject Property

---

|  |
| --- |
| ExportLayerKey Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ExportLayerKey Class

Autodesk.Revit.DB Namespace

#### TileColorVariance Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Color Variance" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TileColorVariance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TileColorVariance As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TileColorVariance { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 100".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### Profile1FamType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Profile"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Profile1FamType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Profile1FamType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Profile1FamType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AreReferencesValidForLinearDimension Method

---

|  |
| --- |
| MultiReferenceAnnotation Class   See Also |

If the DimensionStyleType is Linear, validates that the references are valid for an aligned multi-reference annotation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool AreReferencesValidForLinearDimension( 	Document document, 	ElementId ownerViewId, 	MultiReferenceAnnotationOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AreReferencesValidForLinearDimension ( _ 	document As Document, _ 	ownerViewId As ElementId, _ 	options As MultiReferenceAnnotationOptions _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool AreReferencesValidForLinearDimension( 	Document^ document,  	ElementId^ ownerViewId,  	MultiReferenceAnnotationOptions^ options ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document for the multi-reference annotation.

ownerViewId
:   Type:  Autodesk.Revit.DB ElementId
     The view in which the multi-reference annotation will appear.

options
:   Type:  Autodesk.Revit.DB MultiReferenceAnnotationOptions
     Options containing the references which the dimension will witness.

#### Return Value

True DimensionStyleType does not equal Linear or if an aligned multi-reference annotation can be created from the references.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MultiReferenceAnnotation Class

Autodesk.Revit.DB Namespace

#### TopOfPartElevation Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The associated elevation to the top of fabrication part off of the current level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public double TopOfPartElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TopOfPartElevation As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double TopOfPartElevation { 	double get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### RebarBendData Constructor

---

|  |
| --- |
| RebarBendData Class   See Also |

Constructs a new RebarBendData with default settings.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public RebarBendData() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: RebarBendData() ``` |

# See Also

RebarBendData Class

RebarBendData Overload

Autodesk.Revit.DB.Structure Namespace

#### ViewDependency Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Dependency"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewDependency { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewDependency As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewDependency { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PickBox Method (PickBoxStyle, String)

---

|  |
| --- |
| Selection Class   See Also |

Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public PickedBox PickBox( 	PickBoxStyle style, 	string statusPrompt ) ``` |

| Visual Basic |
| --- |
| ``` Public Function PickBox ( _ 	style As PickBoxStyle, _ 	statusPrompt As String _ ) As PickedBox ``` |

| Visual C++ |
| --- |
| ``` public: PickedBox^ PickBox( 	PickBoxStyle style,  	String^ statusPrompt ) ``` |

#### Parameters

style
:   Type:  Autodesk.Revit.UI.Selection PickBoxStyle
     Specifies the value that controls the style of the pick box.

statusPrompt
:   Type:  System String
     The message shown on the status bar.

#### Return Value

The picked box that contains two XYZ points.

# Remarks

The method starts an editor and returns when it finishes. Returns a PickedBox that contains two XYZ points.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the style is not a recognized value. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the argument statusPrompt is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |

# See Also

Selection Class

PickBox Overload

Autodesk.Revit.UI.Selection Namespace

#### WallTypeWidthMeasuredAt Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Width Measured At"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallTypeWidthMeasuredAt { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallTypeWidthMeasuredAt As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallTypeWidthMeasuredAt { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetFailureDefinitionId Method

---

|  |
| --- |
| FailureMessage Class   See Also |

Retrieves the id of the failure definition for the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureDefinitionId GetFailureDefinitionId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFailureDefinitionId As FailureDefinitionId ``` |

| Visual C++ |
| --- |
| ``` public: FailureDefinitionId^ GetFailureDefinitionId() ``` |

#### Return Value

The id of the FailureDefinition for the failure.

# See Also

FailureMessage Class

Autodesk.Revit.DB Namespace

#### Second Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol s, indicating unit Seconds.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Second { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Second As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Second { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IRebarUpdateServer Interface

---

|  |
| --- |
| Members   See Also |

Represents an interface that should be overridden to allow the generation and update of free form rebar geometry.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public interface IRebarUpdateServer : IExternalServer ``` |

| Visual Basic |
| --- |
| ``` Public Interface IRebarUpdateServer _ 	Inherits IExternalServer ``` |

| Visual C++ |
| --- |
| ``` public interface class IRebarUpdateServer : IExternalServer ``` |

# Remarks

This interface should be overridden in order to create a free form rebar with constraints and to allow generation and update of its geometry.

Once a rebar is created with a server, it will be called  GetCustomHandles(RebarHandlesData)  function. In the execution on this function should be defined the handles of the rebar.

Based on these handles rebar constraints can be defined. Once the constraints are defined a regeneration should be triggered in order to generate the bar geometry.

During the regeneration the functions  GenerateCurves(RebarCurvesData)  and  TrimExtendCurves(RebarTrimExtendData)  will be called. For GenerateCurves() it is supposed to calculate bars in set based on constraints. For TrimExtendCurves() it is supposed to trim or extend curves that were obtained from GenerateCurves(). Also in this function new constraints for start and end bar handles can be created. After the execution of these two functions the bar should appear on screen.

Every time when a constraint is modified a new regeneration is triggered and the functions GenerateCurves() and TrimExtendCurves() are called again.

We also can edit constraints for this rebar. When user starts to do this, the function  GetHandlesPosition(RebarHandlePositionData)  will be called and it is supposed to return positions of handles defined in GetCustomHandles(). This positions will be shown on screen. While editing constraints if the mouse is over a position that was specified, the function  GetCustomHandleName(RebarHandleNameData)  will be called in order to obtain the name of that handle.

While editing constraints an user will modify constraints (e.g. add a new reference or remove one) a regeneration will be triggered and the functions GenerateCurves() and TrimExtendCurves() will be called again.

# See Also

IRebarUpdateServer Members

Autodesk.Revit.DB.Structure Namespace

#### GetLabelFor Method (gbXMLBuildingType, Document)

---

|  |
| --- |
| LabelUtils Class   See Also |

Gets the user-visible name for a gbXMLBuildingType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static string GetLabelFor( 	gbXMLBuildingType buildingType, 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetLabelFor ( _ 	buildingType As gbXMLBuildingType, _ 	document As Document _ ) As String ``` |

| Visual C++ |
| --- |
| ``` public: static String^ GetLabelFor( 	gbXMLBuildingType buildingType,  	Document^ document ) ``` |

#### Parameters

buildingType
:   Type:  Autodesk.Revit.DB.Analysis gbXMLBuildingType
     The gbXMLBuildingType to get the user-visible name.

document
:   Type:  Autodesk.Revit.DB Document
     The document from which to get the gbXMLBuildingType.

# Remarks

The name is obtained in the current Revit language.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input gXMLBuildingType is not available in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace

#### ExportPatternTable Class

---

|  |
| --- |
| Members   See Also |

A table supporting a mapping of FillPatterns in Revit to pattern names that will be set in the target export format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey, ExportPatternInfo>>,  	IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportPatternTable _ 	Implements IEnumerable(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo)),  _ 	IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>,  	IDisposable ``` |

# Remarks

This table is structured as a mapping from  ExportPatternKey  to  ExportPatternInfo  members. The  ExportPatternKey  contains the identification information for the pattern table: the Revit fill pattern type and name. The  ExportPatternInfo  contains the pattern name to use in the export format.

The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the  ExportPatternInfo  returned will be a copy of the  ExportPatternInfo  from the table. In order to make changes to the  ExportPatternInfo  and use those settings during export, set the modified  ExportPatternInfo  back into the table using the same key.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExportPatternTable

# See Also

ExportPatternTable Members

Autodesk.Revit.DB Namespace

#### Size Property

---

|  |
| --- |
| CombinableElementArray Class   See Also |

Returns the number of CombinableElements that are in the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

CombinableElementArray Class

Autodesk.Revit.DB Namespace

#### LayeredNormal Property

---

|  |
| --- |
| AdvancedLayered Class   See Also |

The property labeled "Image" from the "AdvancedLayered" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string LayeredNormal { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LayeredNormal As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ LayeredNormal { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace

#### OnStandby Property

---

|  |
| --- |
| MechanicalEquipmentSet Class   See Also |

The number of pieces of mechanical equipment that are not operational at any given time.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public int OnStandby { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property OnStandby As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int OnStandby { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: There should be at least one equipment on duty. |

# See Also

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### Clear Method

---

|  |
| --- |
| MEPBuildingConstructionSet Class   See Also |

Removes every MEPBuildingConstruction from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

MEPBuildingConstructionSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### MinimumDigits Property

---

|  |
| --- |
| NumericRevisionSettings Class   See Also |

Controls the minimum number of digits for a revision number.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public int MinimumDigits { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MinimumDigits As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int MinimumDigits { 	int get (); 	void set (int value); } ``` |

# Remarks

Use MinimumDigits to force the minimum number of digits for a revision number. Zeros will be added to the front of the revision number until the minimum number of digits is satisfied. For example, if MinimumDigits is 3, then 9 will be printed as 009 and 10 will be printed as 010. If MinimumDigits is 1, then no zeros are added to the front of the revision number. The default value for MinimumDigits is 1. Values less than 1 are not allowed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for minimumDigits is not positive. |

# See Also

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace

#### StructuralConnectionInputElements Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Input Elements"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralConnectionInputElements { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralConnectionInputElements As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralConnectionInputElements { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionIshapeWebToeOfFillet Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Web Toe of Fillet"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionIshapeWebToeOfFillet { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionIshapeWebToeOfFillet As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionIshapeWebToeOfFillet { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FbxLightPhotometrics Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Light Source Definition"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightPhotometrics { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightPhotometrics As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightPhotometrics { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecPowerFactor Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Power Factor"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPowerFactor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPowerFactor As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPowerFactor { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PointCollection Class

---

|  |
| --- |
| Members   See Also |

A class that represents a set of points created and returned by Revit in response to a query.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class PointCollection : IEnumerable<CloudPoint>,  	IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class PointCollection _ 	Implements IEnumerable(Of CloudPoint), IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class PointCollection : IEnumerable<CloudPoint>,  	IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.PointClouds PointCollection

# See Also

PointCollection Members

Autodesk.Revit.DB.PointClouds Namespace

#### UserWorksets Property

---

|  |
| --- |
| RelinquishOptions Class   See Also |

True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool UserWorksets { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property UserWorksets As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool UserWorksets { 	bool get (); 	void set (bool value); } ``` |

# Remarks

This defaults to false in the User Interface.

# See Also

RelinquishOptions Class

Autodesk.Revit.DB Namespace

#### InsulationType Class

---

|  |
| --- |
| Members   See Also |

Represents electrical insulation type definition information.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class InsulationType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class InsulationType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class InsulationType : public ElementType ``` |

# Remarks

Insulation type is defined based on corresponding wire material type and temperature rating type.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Electrical InsulationType

# See Also

InsulationType Members

Autodesk.Revit.DB.Electrical Namespace

#### IsAutomaticLanding Property

---

|  |
| --- |
| StairsLanding Class   See Also |

True if the landing is an automatic landing, False otherwise.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsAutomaticLanding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsAutomaticLanding As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsAutomaticLanding { 	bool get (); } ``` |

# See Also

StairsLanding Class

Autodesk.Revit.DB.Architecture Namespace

#### ConceptualEnergyData Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Conceptual Energy Data"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ConceptualEnergyData { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ConceptualEnergyData As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ConceptualEnergyData { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### GetSystemsAnalysisWorkflowNames Method

---

|  |
| --- |
| Application Class   See Also |

Returns names for systems analysis workflows.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public IList<string> GetSystemsAnalysisWorkflowNames() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSystemsAnalysisWorkflowNames As IList(Of String) ``` |

| Visual C++ |
| --- |
| ``` public: IList<String^>^ GetSystemsAnalysisWorkflowNames() ``` |

#### Return Value

An array of names of systems analysis workflows.

# Remarks

The array that is returned contains the name of the systems analysis workflow, in the order they are specified in Options.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### Size Property

---

|  |
| --- |
| WireTypeSet Class   See Also |

Returns the number of wire types that are in the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual int Size { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Size As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property int Size { 	int get (); } ``` |

# See Also

WireTypeSet Class

Autodesk.Revit.DB.Electrical Namespace

#### FaceIsNoLongerVertical Property

---

|  |
| --- |
| BuiltInFailures WallFailures Class   See Also |

Face defining this vertical Wall is no longer vertical.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FaceIsNoLongerVertical { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FaceIsNoLongerVertical As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FaceIsNoLongerVertical { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallFailures Class

Autodesk.Revit.DB Namespace

#### RebarSystemAddlInteriorOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Additional Interior Cover Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemAddlInteriorOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemAddlInteriorOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemAddlInteriorOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotCutGeometryWarn Property

---

|  |
| --- |
| BuiltInFailures CutFailures Class   See Also |

Elements do not intersect.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutGeometryWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutGeometryWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutGeometryWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CutFailures Class

Autodesk.Revit.DB Namespace

#### CustomAxis Property

---

|  |
| --- |
| IFCExtrusionCalculatorOptions Class   See Also |

The custom axis to try (if extrusionAxes includes an option for a custom direction).

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public XYZ CustomAxis { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CustomAxis As XYZ 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ CustomAxis { 	XYZ^ get (); 	void set (XYZ^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

IFCExtrusionCalculatorOptions Class

Autodesk.Revit.DB.IFC Namespace

#### ExportFontTableIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a set of font table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportFontTableIterator _ 	Implements IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo)) ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>> ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExportFontTableIterator

# See Also

ExportFontTableIterator Members

Autodesk.Revit.DB Namespace

#### StructuralAssetClass Property

---

|  |
| --- |
| StructuralAsset Class   See Also |

The type of material that this structural asset describes (e.g. wood, concrete, metal.)

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public StructuralAssetClass StructuralAssetClass { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StructuralAssetClass As StructuralAssetClass 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralAssetClass StructuralAssetClass { 	StructuralAssetClass get (); } ``` |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| Definitions Class   See Also |

Creates a new parameter definition using specified options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Definition Create( 	ExternalDefinitionCreationOptions option ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Create ( _ 	option As ExternalDefinitionCreationOptions _ ) As Definition ``` |

| Visual C++ |
| --- |
| ``` public: Definition^ Create( 	ExternalDefinitionCreationOptions^ option ) ``` |

#### Parameters

option
:   Type:  Autodesk.Revit.DB ExternalDefinitionCreationOptions
     The options used to create the new parameter definition.

#### Return Value

If successful a reference to the new parameter definition is returned, otherwise    a null reference (  Nothing  in Visual Basic)  .

# Remarks

This method only supports creation of new external definitions (shared parameters).

# See Also

Definitions Class

Autodesk.Revit.DB Namespace

#### GetApplicableDemandFactor Method

---

|  |
| --- |
| ElectricalDemandFactorDefinition Class   See Also |

This method will return the applicable demand factor for the specified number of devices or load.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double GetApplicableDemandFactor( 	double numberOrLoad ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetApplicableDemandFactor ( _ 	numberOrLoad As Double _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetApplicableDemandFactor( 	double numberOrLoad ) ``` |

#### Parameters

numberOrLoad
:   Type:  System Double
     The number of devices or load for which the demand factor should be looked up.

#### Return Value

The applicable demand factor.

# See Also

ElectricalDemandFactorDefinition Class

Autodesk.Revit.DB.Electrical Namespace

#### LbMassPerInSup3 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lb/inÂ³, indicating unit Pounds mass per cubic inch.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LbMassPerInSup3 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LbMassPerInSup3 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LbMassPerInSup3 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelTotalDemandFactorParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Total Demand Factor"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelTotalDemandFactorParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelTotalDemandFactorParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelTotalDemandFactorParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetElementIdValue Method

---

|  |
| --- |
| ScheduleFilter Class   See Also |

Gets the filter value for a filter using an ElementId value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId GetElementIdValue() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElementIdValue As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetElementIdValue() ``` |

#### Return Value

The filter value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | The filter value is not an ElementId. |

# See Also

ScheduleFilter Class

Autodesk.Revit.DB Namespace

#### SetPath Method (String)

---

|  |
| --- |
| ImageTypeOptions Class   See Also |

Update the path of the file that specifies the image to be used.

The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public void SetPath( 	string path ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetPath ( _ 	path As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetPath( 	String^ path ) ``` |

#### Parameters

path
:   Type:  System String
     The file path that specifies the image to be used.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ImageTypeOptions Class

SetPath Overload

Autodesk.Revit.DB Namespace

#### GetDefaultFloorType Method

---

|  |
| --- |
| Floor Class   See Also |

Returns id of default floor type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static ElementId GetDefaultFloorType( 	Document document, 	bool isFoundation ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDefaultFloorType ( _ 	document As Document, _ 	isFoundation As Boolean _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ GetDefaultFloorType( 	Document^ document,  	bool isFoundation ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

isFoundation
:   Type:  System Boolean
     True to return id of foundation floor type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Floor Class

Autodesk.Revit.DB Namespace

#### Elbow Property

---

|  |
| --- |
| MEPCurveType Class   See Also |

The default elbow fitting of the MEP curve type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilySymbol Elbow { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Elbow As FamilySymbol 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FamilySymbol^ Elbow { 	FamilySymbol^ get (); 	void set (FamilySymbol^ value); } ``` |

# Remarks

This property is used to retrieve the default elbow fitting of the MEP curve type, and can be    a null reference (  Nothing  in Visual Basic)  if there is no default value. Use  RoutingPreferenceManager  to set this property for PipeType MEPCurves.

# See Also

MEPCurveType Class

Autodesk.Revit.DB Namespace

#### Formula Property

---

|  |
| --- |
| FamilyParameter Class   See Also |

The formula.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string Formula { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Formula As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Formula { 	String^ get (); } ``` |

# Remarks

Returns    a null reference (  Nothing  in Visual Basic)  if there is no formula governing this parameter.

# See Also

FamilyParameter Class

Autodesk.Revit.DB Namespace

#### FamilyNoExternalParametersError Property

---

|  |
| --- |
| BuiltInFailures FamilyFailures Class   See Also |

Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FamilyNoExternalParametersError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FamilyNoExternalParametersError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FamilyNoExternalParametersError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FamilyFailures Class

Autodesk.Revit.DB Namespace

#### DocumentSaved Event

---

|  |
| --- |
| Application Class   See Also |

Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentSavedEventArgs> DocumentSaved ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentSaved As EventHandler(Of DocumentSavedEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentSavedEventArgs^>^ DocumentSaved { 	void add (EventHandler<DocumentSavedEventArgs^>^ value); 	void remove (EventHandler<DocumentSavedEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished saving a document. Note that the first save of a newly created document will raise  DocumentSavedAs  rather than the DocumentSaved event. It is raised even when document saving failed or was cancelled (during DocumentSaving event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' property in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of saving document has already been finished.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### GetPrimaryViewId Method

---

|  |
| --- |
| View Class   See Also |

Get the id of the primary view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId GetPrimaryViewId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPrimaryViewId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetPrimaryViewId() ``` |

#### Return Value

The id of the primary view, or InvalidElementId if there is no primary view.

# Remarks

The primary view is the view from which a dependent view is created.

# See Also

View Class

Autodesk.Revit.DB Namespace

#### DoesConduitStandardTypeExist Method

---

|  |
| --- |
| ConduitSizeSettings Class   See Also |

Checks if the specified conduit standard exist.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public bool DoesConduitStandardTypeExist( 	string standardName ) ``` |

| Visual Basic |
| --- |
| ``` Public Function DoesConduitStandardTypeExist ( _ 	standardName As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool DoesConduitStandardTypeExist( 	String^ standardName ) ``` |

#### Parameters

standardName
:   Type:  System String
     The conduit standard name.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ConduitSizeSettings Class

Autodesk.Revit.DB.Electrical Namespace

#### Create Method

---

|  |
| --- |
| AnalyticalOpening Class   See Also |

Creates a new instance of an Analytical Opening within the project.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static AnalyticalOpening Create( 	Document aDoc, 	CurveLoop curveLoop, 	ElementId panelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	curveLoop As CurveLoop, _ 	panelId As ElementId _ ) As AnalyticalOpening ``` |

| Visual C++ |
| --- |
| ``` public: static AnalyticalOpening^ Create( 	Document^ aDoc,  	CurveLoop^ curveLoop,  	ElementId^ panelId ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Revit document.

curveLoop
:   Type:  Autodesk.Revit.DB CurveLoop
     CurveLoop for the Analytical Opening.

panelId
:   Type:  Autodesk.Revit.DB ElementId
     ElementId of the AnalyticalPanel on which we create the Opening.

#### Return Value

The newly created AnalyticalOpening instance.

# Remarks

CurveLoop must be planar, not self-intersecting and in the same plane as the Analytical Panel. CurveLoop must intersect or to be inside the AnalyticalPanel contour. PanelId must be the ElementId of an AnalyticalPanel otherwise an exception is thrown.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One of the following requirements is not satisfied : - curve loop curveLoop is not planar - curve loop curveLoop is self-intersecting - curve loop curveLoop contains zero length curves - curve loop curveLoop is not inside or does not intersect the AnalyticalPanel on which we want to create the Opening. - panelId is not the ElementId of an AnalyticalPanel - curve loop curveLoop is not in the same plane as the Analytical Panel |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

AnalyticalOpening Class

Autodesk.Revit.DB.Structure Namespace

#### GetInnerRule Method

---

|  |
| --- |
| FilterInverseRule Class   See Also |

Gets the rule being inverted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilterRule GetInnerRule() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInnerRule As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: FilterRule^ GetInnerRule() ``` |

# See Also

FilterInverseRule Class

Autodesk.Revit.DB Namespace

#### CannotConstrainBasePointAlignments Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Alignments to base points cannot be constrained.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotConstrainBasePointAlignments { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotConstrainBasePointAlignments As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotConstrainBasePointAlignments { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### Visibility Property

---

|  |
| --- |
| DirectContext3DHandleSettings Class   See Also |

Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public bool Visibility { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Visibility As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Visibility { 	bool get (); 	void set (bool value); } ``` |

# See Also

DirectContext3DHandleSettings Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### RbsStartLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reference Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsStartLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsStartLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsStartLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetReportedShape Method

---

|  |
| --- |
| RebarFreeFormAccessor Class   See Also |

This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetReportedShape( 	ElementId rebarShapeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetReportedShape ( _ 	rebarShapeId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetReportedShape( 	ElementId^ rebarShapeId ) ``` |

#### Parameters

rebarShapeId
:   Type:  Autodesk.Revit.DB ElementId

# Remarks

The Rebar element RebarWorkInstructions property should be Straight. The rebarShapeId parameter should be the id of a straight RebarShape (single straight segment, no RebarHookType, no EndTreatmentType). Moreover the straight RebarShape RebarStyle should match ( if the current RebarShape RebarStyle is Standard then the RebarShape cannot be changed to a straigh RebarShape using the RebarStyle Stirrup/Tie ). If current RebarShape and the provided rebarShapeId has Stirrup/Tie RebarStyle then also the StirrupTieAttachmentType should match ( both InteriorFace or ExteriorFace ).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | rebarShapeId cannot be set as a reporting RebarShape for this Rebar element. |

# See Also

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### Dispose Method

---

|  |
| --- |
| Units Class   See Also |

Releases all resources used by the  Units

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

Units Class

Autodesk.Revit.DB Namespace

#### FamilyTemplatePath Property

---

|  |
| --- |
| Application Class   See Also |

Default path for family template files.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string FamilyTemplatePath { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FamilyTemplatePath As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ FamilyTemplatePath { 	String^ get (); } ``` |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### GetFailingElementIds Method

---

|  |
| --- |
| FailureMessageAccessor Class   See Also |

Retrieves Ids of Elements that have caused the failure.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> GetFailingElementIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFailingElementIds As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ GetFailingElementIds() ``` |

#### Return Value

Ids of Elements that have caused the failure.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace

#### CannotHaveIndependentOverlappingGrids Property

---

|  |
| --- |
| BuiltInFailures CurtainWallFailures Class   See Also |

Overlapping independent type associated gridlines are not allowed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotHaveIndependentOverlappingGrids As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotHaveIndependentOverlappingGrids { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CurtainWallFailures Class

Autodesk.Revit.DB Namespace

#### VertexPair Class

---

|  |
| --- |
| Members   See Also |

Indices of a pair of vertices in two CurveLoops(one vertex in each loop).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public class VertexPair : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class VertexPair _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class VertexPair : IDisposable ``` |

# Remarks

A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB VertexPair

# See Also

VertexPair Members

Autodesk.Revit.DB Namespace

#### WriteAccessGranted Method

---

|  |
| --- |
| Schema Class   See Also |

Checks whether Entities of this Schema may be stored by the current add-in.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool WriteAccessGranted() ``` |

| Visual Basic |
| --- |
| ``` Public Function WriteAccessGranted As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool WriteAccessGranted() ``` |

#### Return Value

True if write access is allowed.

# See Also

Schema Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### DebugtabDataboundcontrolsdemoInteger Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Integer"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DebugtabDataboundcontrolsdemoInteger { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DebugtabDataboundcontrolsdemoInteger As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DebugtabDataboundcontrolsdemoInteger { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotConvertSketch Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Can't convert Sketch to Rebar Shape.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotConvertSketch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotConvertSketch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotConvertSketch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### MepAnalyticalLoopName Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Name"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepAnalyticalLoopName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepAnalyticalLoopName As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepAnalyticalLoopName { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| SteelElementProperties Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Steel
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace

#### GetSizeCount Method

---

|  |
| --- |
| CableTraySizes Class   See Also |

Gets the size count of the cable tray size table.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public int GetSizeCount() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSizeCount As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetSizeCount() ``` |

# See Also

CableTraySizes Class

Autodesk.Revit.DB.Electrical Namespace

#### ExternalResourceTypes.BuiltInExternalResourceTypes Class

---

|  |
| --- |
| ExternalResourceTypes Class   Members   See Also |

A collection of ids of the ExternalResourceTypes provided by Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class BuiltInExternalResourceTypes ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class BuiltInExternalResourceTypes ``` |

| Visual C++ |
| --- |
| ``` public ref class BuiltInExternalResourceTypes abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExternalResourceTypes BuiltInExternalResourceTypes

# See Also

ExternalResourceTypes BuiltInExternalResourceTypes Members

Autodesk.Revit.DB Namespace

#### YJustification Enumeration

---

|  |
| --- |
| See Also |

The justification of the framing element in Y.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum YJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration YJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class YJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Left | Justification to the left of the element. |
| Center | Justification to the geometrical center of the element. |
| Origin | Justification to the origin of the element. |
| Right | Justification to the right of the element. |

# See Also

Autodesk.Revit.DB.Structure Namespace

#### GetBlue Method

---

|  |
| --- |
| ColorWithTransparency Class   See Also |

get blue

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public uint GetBlue() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetBlue As UInteger ``` |

| Visual C++ |
| --- |
| ``` public: unsigned int GetBlue() ``` |

#### Return Value

blue

# See Also

ColorWithTransparency Class

Autodesk.Revit.DB Namespace

#### RbsPressureDrop Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Pressure Drop"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPressureDrop { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPressureDrop As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPressureDrop { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WhereElementIsCurveDriven Method

---

|  |
| --- |
| FilteredElementCollector Class   See Also |

Applies an ElementIsCurveDrivenFilter to the collector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilteredElementCollector WhereElementIsCurveDriven() ``` |

| Visual Basic |
| --- |
| ``` Public Function WhereElementIsCurveDriven As FilteredElementCollector ``` |

| Visual C++ |
| --- |
| ``` public: FilteredElementCollector^ WhereElementIsCurveDriven() ``` |

#### Return Value

A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

# Remarks

Only elements that are curve driven will pass the collector. If you have an active iterator to this collector it will be stopped by this call.

# See Also

FilteredElementCollector Class

Autodesk.Revit.DB Namespace

#### FabricationAncillaryType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all fabrication ancillary types.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum FabricationAncillaryType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricationAncillaryType ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricationAncillaryType ``` |

# Members

| Member name | Description |
| --- | --- |
| Unknown | Unknown or unsupported ancillary type. |
| Fixing | Ancillary nuts and bolts. Used to fix and bind other ancillaries. |
| Corner | Ancillary corner joints. Used to join ancillary materials." |
| Clip | Ancillary clips and washers. Used to additionally fix and clip ancillaries together. |
| TieRod | Ancillary tie rod types. Used to internally stiffen fittings. |
| Gasket | Ancillary gaskets. Used to seal connector joints. |
| Sealant | Ancillary sealants. Used to seal seams. |
| SupportRod | Ancillary support drop rod types. Used to support fittings. |
| AncillaryMaterial | Ancillary materials used to support and externally stiffen fittings, eg. angle iron, unistrut. |
| AirturnTrack | Ancillary airturn tracks. Used to fasten airturn vanes in place. |
| AirturnVane | Ancillary airturn vanes. Used to manage flow through fittings. |
| Isolator | Ancillary support isolators. Used inline ancillary support rods. |
| SeamMaterial | Ancillary seam material. |

# See Also

Autodesk.Revit.DB.Fabrication Namespace

#### VVDerivative Property

---

|  |
| --- |
| FaceSecondDerivatives Class   See Also |

The second derivative with respect to V.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public XYZ VVDerivative { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VVDerivative As XYZ 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property XYZ^ VVDerivative { 	XYZ^ get (); } ``` |

# See Also

FaceSecondDerivatives Class

Autodesk.Revit.DB Namespace

#### IsValidPathForRailing Method

---

|  |
| --- |
| Railing Class   See Also |

Checks whether a railing can be created along a railing path.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static bool IsValidPathForRailing( 	CurveLoop curveLoop ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidPathForRailing ( _ 	curveLoop As CurveLoop _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidPathForRailing( 	CurveLoop^ curveLoop ) ``` |

#### Parameters

curveLoop
:   Type:  Autodesk.Revit.DB CurveLoop
     The railing path along which the new railing will be created.

#### Return Value

True if the new railing path can be used in a railing definition, False otherwise.

# Remarks

The railing path should be located on the same horizontal plane and it should contain lines or arcs only. It also has to be continuous and its three or more curves cannot meet in one end point.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Railing Class

Autodesk.Revit.DB.Architecture Namespace

#### SteelElemCutType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemCutType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemCutType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemCutType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CutLineDistance Property

---

|  |
| --- |
| CutMarkType Class   See Also |

The distance between 2 cut lines.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double CutLineDistance { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property CutLineDistance As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double CutLineDistance { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for distanceBetweenTwoLines must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The cut mark type is not a double cut line type. |

# See Also

CutMarkType Class

Autodesk.Revit.DB.Architecture Namespace

#### InvalidPathArgumentException Class

---

|  |
| --- |
| Members   See Also |

The exception that is thrown when a method received a pathname as an argument, but the pathname is illegal: too long, invalid characters, etc.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` [SerializableAttribute] public class InvalidPathArgumentException : ArgumentException ``` |

| Visual Basic |
| --- |
| ``` <SerializableAttribute> _ Public Class InvalidPathArgumentException _ 	Inherits ArgumentException ``` |

| Visual C++ |
| --- |
| ``` [SerializableAttribute] public ref class InvalidPathArgumentException : public ArgumentException ``` |

# Inheritance Hierarchy

System Object
  System Exception
  Autodesk.Revit.Exceptions ApplicationException
  Autodesk.Revit.Exceptions ArgumentException
  Autodesk.Revit.Exceptions InvalidPathArgumentException

# See Also

InvalidPathArgumentException Members

Autodesk.Revit.Exceptions Namespace

#### Parameter Property

---

|  |
| --- |
| ParameterValueProvider Class   See Also |

The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementId Parameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Parameter As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ Parameter { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ParameterValueProvider Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| FabricationRodInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

FabricationRodInfo Class

Autodesk.Revit.DB Namespace

#### WPerMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol W/mÂ², indicating unit Watts per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WPerMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WPerMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WPerMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| EdgeArray Class   See Also |

Test to see if the array is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the array is empty then True will be returned, otherwise False.

# See Also

EdgeArray Class

Autodesk.Revit.DB Namespace

#### RebarSystemHookOrientBackDirn1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Interior Major Hook Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemHookOrientBackDirn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemHookOrientBackDirn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemHookOrientBackDirn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotMoveHostedFixtureViaCopyMonitor Property

---

|  |
| --- |
| BuiltInFailures CopyMonitorFailures Class   See Also |

The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotMoveHostedFixtureViaCopyMonitor As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotMoveHostedFixtureViaCopyMonitor { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyMonitorFailures Class

Autodesk.Revit.DB Namespace

#### ViewInAModelMustBeUnique Property

---

|  |
| --- |
| BuiltInFailures ViewSheetFailures Class   See Also |

Sheet views in this model cannot contain more than one instance of "%1!s!."

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ViewInAModelMustBeUnique { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewInAModelMustBeUnique As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ViewInAModelMustBeUnique { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ViewSheetFailures Class

Autodesk.Revit.DB Namespace

#### GetMassZoneIds Method

---

|  |
| --- |
| MassGBXMLExportOptions Class   See Also |

Gets a list of mass zones to analyze in the exported gbXML.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<ElementId> GetMassZoneIds() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMassZoneIds As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: IList<ElementId^>^ GetMassZoneIds() ``` |

#### Return Value

The ids of the mass zone.

# See Also

MassGBXMLExportOptions Class

Autodesk.Revit.DB.Analysis Namespace

#### ViewId Property

---

|  |
| --- |
| ViewExportedEventArgs Class   See Also |

Identifies the view that was exported.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElementId ViewId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ViewId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ViewId { 	ElementId^ get (); } ``` |

# See Also

ViewExportedEventArgs Class

Autodesk.Revit.DB.Events Namespace

#### FittingMustBeOnPipe Property

---

|  |
| --- |
| BuiltInFailures ConnectorFailures Class   See Also |

The [Tap] must be attached to pipe.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FittingMustBeOnPipe { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FittingMustBeOnPipe As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FittingMustBeOnPipe { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ConnectorFailures Class

Autodesk.Revit.DB Namespace

#### IsValidConditionIndex Method

---

|  |
| --- |
| FabricationServiceButton Class   See Also |

Validates if the given condition index is valid or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static bool IsValidConditionIndex( 	FabricationServiceButton button, 	int condition ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidConditionIndex ( _ 	button As FabricationServiceButton, _ 	condition As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidConditionIndex( 	FabricationServiceButton^ button,  	int condition ) ``` |

#### Parameters

button
:   Type:  Autodesk.Revit.DB FabricationServiceButton
     The button to check.

condition
:   Type:  System Int32
     The condition index.

#### Return Value

True if larger or equal to 0 and less than ConditionCount.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationServiceButton Class

Autodesk.Revit.DB Namespace

#### CommonTintColor Property

---

|  |
| --- |
| Concrete Class   See Also |

The property labeled "Tint Color" from the "Concrete" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CommonTintColor { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CommonTintColor As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CommonTintColor { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDoubleArray4d".

# See Also

Concrete Class

Autodesk.Revit.DB.Visual Namespace

#### TagTag Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Label"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TagTag { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TagTag As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TagTag { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DataDictionaryDifferentInLink Property

---

|  |
| --- |
| BuiltInFailures LinkFailures Class   See Also |

Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DataDictionaryDifferentInLink { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DataDictionaryDifferentInLink As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DataDictionaryDifferentInLink { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures LinkFailures Class

Autodesk.Revit.DB Namespace

#### EqualityConstraintsUnsatisfiedWarn Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId EqualityConstraintsUnsatisfiedWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EqualityConstraintsUnsatisfiedWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ EqualityConstraintsUnsatisfiedWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### Profile1OffsetX Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Profile Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Profile1OffsetX { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Profile1OffsetX As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Profile1OffsetX { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| FilteredElementIdIterator Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

FilteredElementIdIterator Class

Autodesk.Revit.DB Namespace

#### RemoveEndReference Method

---

|  |
| --- |
| StructuralFramingUtils Class   See Also |

Resets the end reference of the structural framing element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static void RemoveEndReference( 	FamilyInstance familyInstance, 	int end ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub RemoveEndReference ( _ 	familyInstance As FamilyInstance, _ 	end As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void RemoveEndReference( 	FamilyInstance^ familyInstance,  	int end ) ``` |

#### Parameters

familyInstance
:   Type:  Autodesk.Revit.DB FamilyInstance
     The FamilyInstance, which must be of a structural framing category, non-concrete and joined.

end
:   Type:  System Int32
     The index of the end (0 for the start, 1 for the end).

# Remarks

The setback value will be changed as a result of the removal.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | end must be 0 or 1. |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set. |

# See Also

StructuralFramingUtils Class

Autodesk.Revit.DB.Structure Namespace

#### PointLoad Class

---

|  |
| --- |
| Members   Example   See Also |

An object that represents a force/moment applied to a single point.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class PointLoad : LoadBase ``` |

| Visual Basic |
| --- |
| ``` Public Class PointLoad _ 	Inherits LoadBase ``` |

| Visual C++ |
| --- |
| ``` public ref class PointLoad : public LoadBase ``` |

# Examples

 Copy  C#

```
private void Getinfo_PointLoad(PointLoad pointLoad)
{
    string message = "Point Load :";

    // Get the load case name
    message += "\nLoad case for load: " + pointLoad.LoadCaseName;

    //get the three dimensional force applied to the point load
    message += "\nForce: (" + pointLoad.ForceVector.X + ", " +
             pointLoad.ForceVector.Y + ", " + pointLoad.ForceVector.Z + ")";

    //get the three dimensional moment application to the point load
    message += "\nMoment: (" + pointLoad.MomentVector.X + ", " +
             pointLoad.MomentVector.Y + ", " + pointLoad.MomentVector.Z + ")";

    //get the three dimensional coordinates of point load
    message += "\nPoint load location: (" + pointLoad.Point.X + ", " +
             pointLoad.Point.Y + ", " + pointLoad.Point.Z + ")";

    TaskDialog.Show("Revit",message);
}
```

 Copy  VB.NET

```
Private Sub Getinfo_PointLoad(pointLoad As PointLoad)
    Dim message As String = "Point Load :"

    ' Get the load case name
    message += vbLf & "Load case for load: " & Convert.ToString(pointLoad.LoadCaseName)

    'get the three dimensional force applied to the point load
 message += vbLf & "Force: (" & Convert.ToString(pointLoad.ForceVector.X) & ", " & Convert.ToString(pointLoad.ForceVector.Y) & ", " & Convert.ToString(pointLoad.ForceVector.Z) & ")"

    'get the three dimensional moment application to the point load
 message += vbLf & "Moment: (" & Convert.ToString(pointLoad.MomentVector.X) & ", " & Convert.ToString(pointLoad.MomentVector.Y) & ", " & Convert.ToString(pointLoad.MomentVector.Z) & ")"

    'get the three dimensional coordinates of point load
    message += vbLf & "Point load location: (" & Convert.ToString(pointLoad.Point.X) & ", " & Convert.ToString(pointLoad.Point.Y) & ", " & Convert.ToString(pointLoad.Point.Z) & ")"

    TaskDialog.Show("Revit", message)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB.Structure LoadBase
  Autodesk.Revit.DB.Structure PointLoad

# See Also

PointLoad Members

Autodesk.Revit.DB.Structure Namespace

#### GetObjectData Method

---

|  |
| --- |
| CentralModelException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

CentralModelException Class

Autodesk.Revit.Exceptions Namespace

#### NewUV Method

---

|  |
| --- |
| Application Class   See Also |

Creates a UV object at the origin.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public UV NewUV() ``` |

| Visual Basic |
| --- |
| ``` Public Function NewUV As UV ``` |

| Visual C++ |
| --- |
| ``` public: UV^ NewUV() ``` |

# See Also

Application Class

NewUV Overload

Autodesk.Revit.Creation Namespace

#### NewFlexDuct Method (Connector, IList(XYZ), FlexDuctType)

---

|  |
| --- |
| Document Class   See Also |

Adds a new flexible duct into the document, using a connector, point array and duct type.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FlexDuct NewFlexDuct( 	Connector connector, 	IList<XYZ> points, 	FlexDuctType ductType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewFlexDuct ( _ 	connector As Connector, _ 	points As IList(Of XYZ), _ 	ductType As FlexDuctType _ ) As FlexDuct ``` |

| Visual C++ |
| --- |
| ``` public: FlexDuct^ NewFlexDuct( 	Connector^ connector,  	IList<XYZ^>^ points,  	FlexDuctType^ ductType ) ``` |

#### Parameters

connector
:   Type:  Autodesk.Revit.DB Connector
     The connector to be connected to the duct, including the end points.

points
:   Type:  System.Collections.Generic IList   XYZ
     The point array indicating the path of the flexible duct.

ductType
:   Type:  Autodesk.Revit.DB.Mechanical FlexDuctType
     The type of the flexible duct.

#### Return Value

If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.

# Remarks

If the connector is a fitting or equipment connector of the correct domain, and if the connector's direction matches the direction of the flexible duct to be created, the connectors will be automatically connected. A transition fitting will be added at the connector(s) if necessary. If the connector's type, domain, does not match the one of the input connector, no connection will be established.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument connector or points is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the flexible duct cannot be created or regenerate fails. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the flexible duct type does not exist in the given document. |

# See Also

Document Class

NewFlexDuct Overload

Autodesk.Revit.Creation Namespace

#### HvacTemperature Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Temperature, in discipline HVAC.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HvacTemperature { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HvacTemperature As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HvacTemperature { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### LoadNatureName Property

---

|  |
| --- |
| LoadBase Class   See Also |

A string representing the nature of the load.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string LoadNatureName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LoadNatureName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ LoadNatureName { 	String^ get (); } ``` |

# See Also

LoadBase Class

Autodesk.Revit.DB.Structure Namespace

#### GetMaximumIndentLevel Method

---

|  |
| --- |
| FormattedText Class   See Also |

Returns the maximum allowed indent level

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public int GetMaximumIndentLevel() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMaximumIndentLevel As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int GetMaximumIndentLevel() ``` |

# See Also

FormattedText Class

Autodesk.Revit.DB Namespace

#### NewFilterId Property

---

|  |
| --- |
| FilterDialog Class   See Also |

The ElementId of the new filter created. The value is populated after Show method is executed.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public ElementId NewFilterId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NewFilterId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ NewFilterId { 	ElementId^ get (); } ``` |

# See Also

FilterDialog Class

Autodesk.Revit.UI Namespace

#### SurfaceResolutionOutOfRange Property

---

|  |
| --- |
| BuiltInFailures EnergyAnalysisFailures Class   See Also |

Pixel size is out of range.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SurfaceResolutionOutOfRange { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceResolutionOutOfRange As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SurfaceResolutionOutOfRange { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EnergyAnalysisFailures Class

Autodesk.Revit.DB Namespace

#### IsPlaceholder Property

---

|  |
| --- |
| Pipe Class   See Also |

Identifies if the pipe is a placeholder or not.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsPlaceholder { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsPlaceholder As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsPlaceholder { 	bool get (); } ``` |

# See Also

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace

#### StructuralSectionCantileverHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cantilever Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionCantileverHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionCantileverHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionCantileverHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TestPoint Method

---

|  |
| --- |
| PointCloudFilter Class   See Also |

Checks if a point is inside the volume of interest.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool TestPoint( 	CloudPoint point ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function TestPoint ( _ 	point As CloudPoint _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool TestPoint( 	CloudPoint point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB.PointClouds CloudPoint
     The point to be tested.

#### Return Value

If true, the point is accepted, if false, the point is not accepted.

# See Also

PointCloudFilter Class

Autodesk.Revit.DB.PointClouds Namespace

#### Ceramic Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the Ceramic visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class Ceramic ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class Ceramic ``` |

| Visual C++ |
| --- |
| ``` public ref class Ceramic abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual Ceramic

# See Also

Ceramic Members

Autodesk.Revit.DB.Visual Namespace

#### FbxLightEfficacy Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Efficacy"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightEfficacy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightEfficacy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightEfficacy { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsDocumentTransmitted Method

---

|  |
| --- |
| TransmissionData Class   See Also |

Determines whether the document at a given file location is transmitted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool IsDocumentTransmitted( 	ModelPath filePath ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsDocumentTransmitted ( _ 	filePath As ModelPath _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsDocumentTransmitted( 	ModelPath^ filePath ) ``` |

#### Parameters

filePath
:   Type:  Autodesk.Revit.DB ModelPath
     The path to the document whose transmitted state will be checked.

#### Return Value

True if the document is a transmitted file, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

TransmissionData Class

Autodesk.Revit.DB Namespace